org/recipes/recipes.org
#+TITLE: Recipes
#+SETUPFILE: theme/theme.setup
#+OPTIONS: toc:nil creator:nil timestamp:nil html-postamble:nil num:nil

* [2019-12-24] Oat & Lentil "Meat Loaf"
  [[https://gamechangersmovie.com/recipes/oat-lentil-meat-loaf/][Original link]]

** Ingredients
   - 2 medium carrots, grated
   - 1 zuchinni, grated
   - ½ onion, chopped
   - 2 cloves garlic, minced or pressed
   - 300g firm tofu, drained
   - ¼ cup walnuts, finely ground
   - ½ cup cooked brown lentils
   - 1¼ cups quick-cooking oats
   - 3 tablespoons soy sauce
   - 2 tablespoons BBQ sauce or ketchup (plus additional for topping)
   - 1 tablespoon Dijon mustard
   - 2 teaspoons dried parsley
   - ½ teaspoon thyme
   - ½ teaspoon sage
   - ½ teaspoon rosemary
     
** Instructions
   1. Preheat the oven to 375ºF/190ºC.
   2. Sauté the carrot, zuchinni, onion, and garlic on high heat in a skillet with a few drops of water for 5 minutes, until tender. Remove from heat and cool.
   3. Mash the tofu in a large bowl. Stir in the cooked mixture and remaining ingredients, and combine well.
   4. Spoon the mixture into a parchment-lined loaf pan. Top with a layer of BBQ sauce.
   5. Bake for 55–60 minutes, or until a toothpick inserted in the center comes out clean.
      
** Tips
   - This meatloaf is wonderful the next day pan-fried on whole grain bread with mustard, pickles, and ketchup.

* [2019-10-02] Edamame Brown Rice Bowl                                 :bowl:

** Ingredients
*** Tamari scallion sauce
    - 1 cup sliced green onions
    - ¼ cup rice vinegar
    - 2 tbsp orange juice
    - 4 tsp sesame oil
    - 1 tsp tamari/soy sauce

*** Other bits
    - 1 cup cooked brown rice
    - 4 cup shelled edamame
    - 1/3 cup roasted sliced almonds (optional)

** Instructions
   1. Make the sauce by putting all sauce ingredients into the blender until sorta smooth.
   2. Assemble the bowl with equal parts rice and edamame, then drizzle with a couple tablespoons of sauce. Sprinkle with almonds if so desired. 

* [2019-10-02] Oil-Free Hummus                              :sauce:chickpeas:
  [[https://elavegan.com/oil-free-hummus/][Original link]]

** Ingredients
   - One can chickpeas
   - 1/4 cup (60 g) tahini
   - 4 tbsp (40 ml) lemon juice (or more to taste)
   - 1/3 tsp salt or more to taste
   - 1/4 tsp ground cumin
   - 4 tbsp (40 ml) plant-based milk (or more for a creamier hummus)
   - 2-3 small cloves of garlic
   - 1/3 tsp baking soda
   - Paprika for serving
   - Fresh parsley for serving

** Instructions
   1. Rinse and drain canned chickpeas, then place in a medium saucepan and add 1/3 tsp baking soda. Cover chickpeas by at least 2 inches (ca. 5 cm) of water and bring to a boil over high heat. See recipe notes if you want to cook the chickpeas from dry.
   2. Boil the chickpeas for about 15 minutes. Once they look overcooked and slightly mushy, they are ready! Drain the chickpeas in a strainer, rinse with plenty of cool water and set aside.
   3. Process the lemon juice, garlic, salt, cumin, half of the plant-based milk, and tahini in a food processor until the mixture is smooth and creamy. Pause the food processor to scrape down the sides of the processor.
   4. Add the mushy chickpeas to the food processor and blend for about 1-2 minutes, scraping down the sides of the processor as needed.
   5. Now add the remaining plant-based milk and blend for a further 1-2 minutes, or until very smooth, creamy and fluffy.
   6. Taste the hummus and add more salt to taste and more lemon juice, if desired.
   7. Serve in a bowl and top with more lemon juice (I also added a bit of the chickpea cooking water), a dash of paprika (use smoked paprika for a variation), and fresh herbs.
   8. Store leftover hummus covered in the refrigerator for up to 5-6 days.

** Notes
   - If you don't want to use canned chickpeas you can cook them from dry. Here is how:
   - In a medium bowl, cover 3/4 cup (150 grams) dried chickpeas by at least 2 inches (ca. 5 cm) of cold water.
   - Add 1/2 tsp baking soda and let soak at room temperature overnight. Drain and rinse.
   - In a medium pot, cover soaked chickpeas by about 4 inches (ca. 10 cm) of water.
   - Add 1/2 tsp baking soda and bring to a boil over high heat.
   - Reduce the heat and simmer until chickpeas are soft, about 1 1/2 hours.
   - Drain and rinse under running water.
   - Recipe serves 6. 

* [2019-08-12] Vegan Palak Paneer                                      :rice:
  [[https://minimalistbaker.com/vegan-palak-paneer-with-curried-tofu/][Original link]]

** Ingredients
*** Tofu
    - 1 450g block firm tofu (drained, patted dry, and cubed)
    - 1 ½ tsp curry powder (or store-bought)
    - 1 Tbsp coconut aminos
    - 1/4 tsp sea salt
    - 2 tsp nutritional yeast (adds a slightly cheesy flavor)

*** Spinach
    - 5 cups loosely packed fresh spinach (about 170g)
    - Water

*** Vegetables
    - 1 ½ Tbsp avocado or coconut oil (or sub water + add more as needed)
    - 1 ½ tsp cumin seed (or ground cumin)
    - 2 Tbsp minced ginger
    - 1 medium diced white onion
    - 1 serrano or jalapeno pepper (seeds removed, diced // add more or less to preferred spiciness)
    - 1 can diced tomatoes (slightly drained // or sub fresh chopped ripe tomatoes)
    - 4 cloves garlic 
    - 1/4-1/2 cup vegetable broth or water

*** Sauce
    - 1 ½ Tbsp avocado or coconut oil (or sub water + add more as needed)
    - 2 tsp curry powder
    - 1 tsp garam masala
    - 1/3 cup full fat coconut milk (plus more for serving)
    -  Sea salt, coconut aminos, or tamari (to taste // we used a few teaspoons of coconut aminos)

*** For serving (optional)
    - Rice or Quinoa
    - Cilantro
    - Garlic Naan

