docs/recipes/recipes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Recipes</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Recipes</h1>

<div id="outline-container-org29b28fe" class="outline-2">
<h2 id="org29b28fe"><span class="timestamp-wrapper"><span class="timestamp">[2019-12-24 Tue] </span></span> Oat &amp; Lentil "Meat Loaf"</h2>
<div class="outline-text-2" id="text-org29b28fe">
<p>
<a href="https://gamechangersmovie.com/recipes/oat-lentil-meat-loaf/">Original link</a>
</p>
</div>

<div id="outline-container-org6661d91" class="outline-3">
<h3 id="org6661d91">Ingredients</h3>
<div class="outline-text-3" id="text-org6661d91">
<ul class="org-ul">
<li>2 medium carrots, grated</li>
<li>1 zuchinni, grated</li>
<li>½ onion, chopped</li>
<li>2 cloves garlic, minced or pressed</li>
<li>300g firm tofu, drained</li>
<li>¼ cup walnuts, finely ground</li>
<li>½ cup cooked brown lentils</li>
<li>1¼ cups quick-cooking oats</li>
<li>3 tablespoons soy sauce</li>
<li>2 tablespoons BBQ sauce or ketchup (plus additional for topping)</li>
<li>1 tablespoon Dijon mustard</li>
<li>2 teaspoons dried parsley</li>
<li>½ teaspoon thyme</li>
<li>½ teaspoon sage</li>
<li>½ teaspoon rosemary</li>
</ul>
</div>
</div>

<div id="outline-container-org361fdf0" class="outline-3">
<h3 id="org361fdf0">Instructions</h3>
<div class="outline-text-3" id="text-org361fdf0">
<ol class="org-ol">
<li>Preheat the oven to 375ºF/190ºC.</li>
<li>Sauté the carrot, zuchinni, onion, and garlic on high heat in a skillet with a few drops of water for 5 minutes, until tender. Remove from heat and cool.</li>
<li>Mash the tofu in a large bowl. Stir in the cooked mixture and remaining ingredients, and combine well.</li>
<li>Spoon the mixture into a parchment-lined loaf pan. Top with a layer of BBQ sauce.</li>
<li>Bake for 55–60 minutes, or until a toothpick inserted in the center comes out clean.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd6f05a9" class="outline-3">
<h3 id="orgd6f05a9">Tips</h3>
<div class="outline-text-3" id="text-orgd6f05a9">
<ul class="org-ul">
<li>This meatloaf is wonderful the next day pan-fried on whole grain bread with mustard, pickles, and ketchup.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9e0e5e3" class="outline-2">
<h2 id="org9e0e5e3"><span class="timestamp-wrapper"><span class="timestamp">[2019-10-02 Wed] </span></span> Edamame Brown Rice Bowl&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bowl">bowl</span></span></h2>
<div class="outline-text-2" id="text-org9e0e5e3">
</div>
<div id="outline-container-orgd93fa56" class="outline-3">
<h3 id="orgd93fa56">Ingredients</h3>
<div class="outline-text-3" id="text-orgd93fa56">
</div>
<div id="outline-container-org1fc1014" class="outline-4">
<h4 id="org1fc1014">Tamari scallion sauce</h4>
<div class="outline-text-4" id="text-org1fc1014">
<ul class="org-ul">
<li>1 cup sliced green onions</li>
<li>¼ cup rice vinegar</li>
<li>2 tbsp orange juice</li>
<li>4 tsp sesame oil</li>
<li>1 tsp tamari/soy sauce</li>
</ul>
</div>
</div>

<div id="outline-container-orgf849c20" class="outline-4">
<h4 id="orgf849c20">Other bits</h4>
<div class="outline-text-4" id="text-orgf849c20">
<ul class="org-ul">
<li>1 cup cooked brown rice</li>
<li>4 cup shelled edamame</li>
<li>1/3 cup roasted sliced almonds (optional)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeb62d75" class="outline-3">
<h3 id="orgeb62d75">Instructions</h3>
<div class="outline-text-3" id="text-orgeb62d75">
<ol class="org-ol">
<li>Make the sauce by putting all sauce ingredients into the blender until sorta smooth.</li>
<li>Assemble the bowl with equal parts rice and edamame, then drizzle with a couple tablespoons of sauce. Sprinkle with almonds if so desired.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org6826d77" class="outline-2">
<h2 id="org6826d77"><span class="timestamp-wrapper"><span class="timestamp">[2019-10-02 Wed] </span></span> Oil-Free Hummus&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sauce">sauce</span>&#xa0;<span class="chickpeas">chickpeas</span></span></h2>
<div class="outline-text-2" id="text-org6826d77">
<p>
<a href="https://elavegan.com/oil-free-hummus/">Original link</a>
</p>
</div>

<div id="outline-container-org216c104" class="outline-3">
<h3 id="org216c104">Ingredients</h3>
<div class="outline-text-3" id="text-org216c104">
<ul class="org-ul">
<li>One can chickpeas</li>
<li>1/4 cup (60 g) tahini</li>
<li>4 tbsp (40 ml) lemon juice (or more to taste)</li>
<li>1/3 tsp salt or more to taste</li>
<li>1/4 tsp ground cumin</li>
<li>4 tbsp (40 ml) plant-based milk (or more for a creamier hummus)</li>
<li>2-3 small cloves of garlic</li>
<li>1/3 tsp baking soda</li>
<li>Paprika for serving</li>
<li>Fresh parsley for serving</li>
</ul>
</div>
</div>

<div id="outline-container-org86f8bb8" class="outline-3">
<h3 id="org86f8bb8">Instructions</h3>
<div class="outline-text-3" id="text-org86f8bb8">
<ol class="org-ol">
<li>Rinse and drain canned chickpeas, then place in a medium saucepan and add 1/3 tsp baking soda. Cover chickpeas by at least 2 inches (ca. 5 cm) of water and bring to a boil over high heat. See recipe notes if you want to cook the chickpeas from dry.</li>
<li>Boil the chickpeas for about 15 minutes. Once they look overcooked and slightly mushy, they are ready! Drain the chickpeas in a strainer, rinse with plenty of cool water and set aside.</li>
<li>Process the lemon juice, garlic, salt, cumin, half of the plant-based milk, and tahini in a food processor until the mixture is smooth and creamy. Pause the food processor to scrape down the sides of the processor.</li>
<li>Add the mushy chickpeas to the food processor and blend for about 1-2 minutes, scraping down the sides of the processor as needed.</li>
<li>Now add the remaining plant-based milk and blend for a further 1-2 minutes, or until very smooth, creamy and fluffy.</li>
<li>Taste the hummus and add more salt to taste and more lemon juice, if desired.</li>
<li>Serve in a bowl and top with more lemon juice (I also added a bit of the chickpea cooking water), a dash of paprika (use smoked paprika for a variation), and fresh herbs.</li>
<li>Store leftover hummus covered in the refrigerator for up to 5-6 days.</li>
</ol>
</div>
</div>

<div id="outline-container-org7c9947c" class="outline-3">
<h3 id="org7c9947c">Notes</h3>
<div class="outline-text-3" id="text-org7c9947c">
<ul class="org-ul">
<li>If you don't want to use canned chickpeas you can cook them from dry. Here is how:</li>
<li>In a medium bowl, cover 3/4 cup (150 grams) dried chickpeas by at least 2 inches (ca. 5 cm) of cold water.</li>
<li>Add 1/2 tsp baking soda and let soak at room temperature overnight. Drain and rinse.</li>
<li>In a medium pot, cover soaked chickpeas by about 4 inches (ca. 10 cm) of water.</li>
<li>Add 1/2 tsp baking soda and bring to a boil over high heat.</li>
<li>Reduce the heat and simmer until chickpeas are soft, about 1 1/2 hours.</li>
<li>Drain and rinse under running water.</li>
<li>Recipe serves 6.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org38621ec" class="outline-2">
<h2 id="org38621ec"><span class="timestamp-wrapper"><span class="timestamp">[2019-08-12 Mon] </span></span> Vegan Palak Paneer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rice">rice</span></span></h2>
<div class="outline-text-2" id="text-org38621ec">
<p>
<a href="https://minimalistbaker.com/vegan-palak-paneer-with-curried-tofu/">Original link</a>
</p>
</div>

<div id="outline-container-org574a8cd" class="outline-3">
<h3 id="org574a8cd">Ingredients</h3>
<div class="outline-text-3" id="text-org574a8cd">
</div>
<div id="outline-container-org69e8dcf" class="outline-4">
<h4 id="org69e8dcf">Tofu</h4>
<div class="outline-text-4" id="text-org69e8dcf">
<ul class="org-ul">
<li>1 450g block firm tofu (drained, patted dry, and cubed)</li>
<li>1 ½ tsp curry powder (or store-bought)</li>
<li>1 Tbsp coconut aminos</li>
<li>1/4 tsp sea salt</li>
<li>2 tsp nutritional yeast (adds a slightly cheesy flavor)</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd0b2d2" class="outline-4">
<h4 id="orgdd0b2d2">Spinach</h4>
<div class="outline-text-4" id="text-orgdd0b2d2">
<ul class="org-ul">
<li>5 cups loosely packed fresh spinach (about 170g)</li>
<li>Water</li>
</ul>
</div>
</div>

<div id="outline-container-org3c22a77" class="outline-4">
<h4 id="org3c22a77">Vegetables</h4>
<div class="outline-text-4" id="text-org3c22a77">
<ul class="org-ul">
<li>1 ½ Tbsp avocado or coconut oil (or sub water + add more as needed)</li>
<li>1 ½ tsp cumin seed (or ground cumin)</li>
<li>2 Tbsp minced ginger</li>
<li>1 medium diced white onion</li>
<li>1 serrano or jalapeno pepper (seeds removed, diced // add more or less to preferred spiciness)</li>
<li>1 can diced tomatoes (slightly drained // or sub fresh chopped ripe tomatoes)</li>
<li>4 cloves garlic</li>
<li>1/4-1/2 cup vegetable broth or water</li>
</ul>
</div>
</div>

<div id="outline-container-org0e1e15a" class="outline-4">
<h4 id="org0e1e15a">Sauce</h4>
<div class="outline-text-4" id="text-org0e1e15a">
<ul class="org-ul">
<li>1 ½ Tbsp avocado or coconut oil (or sub water + add more as needed)</li>
<li>2 tsp curry powder</li>
<li>1 tsp garam masala</li>
<li>1/3 cup full fat coconut milk (plus more for serving)</li>
<li>Sea salt, coconut aminos, or tamari (to taste // we used a few teaspoons of coconut aminos)</li>
</ul>
</div>
</div>

<div id="outline-container-org81da66c" class="outline-4">
<h4 id="org81da66c">For serving (optional)</h4>
<div class="outline-text-4" id="text-org81da66c">
<ul class="org-ul">
<li>Rice or Quinoa</li>
<li>Cilantro</li>
<li>Garlic Naan</li>
</ul>
</div>
</div>
</div>
