org/recipes/recipes.org
** Instructions
   1. This recipe is all about multi-tasking and is totally doable in 30 minutes. Start by preheating the oven to 210°C and draining your tofu. Then wrap in a clean towel and set something heavy on top. (This step can also be done in advance with a tofu press.)
   1. Cube tofu and add to a medium mixing bowl. Season with curry powder, coconut aminos, sea salt, and nutritional yeast. Shake the bowl to gently toss. Set aside.
   1. Heat a medium oven-safe seasoned cast iron over medium heat (if using a stainless steel skillet, add a little oil so it doesn’t stick). Once hot, add the tofu and sauté for 3-4 minutes, or until a couple of the sides are browned. Then transfer to the hot oven and bake for 15 minutes. If you prefer firmer tofu, bake longer. If you want softer tofu that mocks paneer, bake less. Set aside to rest in the pan.
   1. Fill a large pot halfway full with water and bring to a boil over high heat. While you wait, move on to the next step.
   1. Heat a large rimmed skillet over medium heat. Once hot, add oil and cumin seed, ginger, onion, and serrano pepper. Sauté until onion is soft and translucent — about 5 minutes.
   1. Add diced tomatoes and garlic and stir to combine. Sauté for 3-4 minutes, or until the tomato has softened.
   1. Your water should be boiling now. Add spinach and cook uncovered for 2 minutes. Then strain and rinse with cold water. Drain well. Set aside.
   1. Add the tomato mixture to a blender or food processor along with cooked drained spinach and the vegetable broth (or water). Blend into a smooth sauce, scraping down sides as needed. If it has trouble blending, add more vegetable broth or water.
   1. Lastly, cook your sauce. Heat the same rimmed skillet from earlier over medium heat. Once hot, add remaining oil (or some water), curry powder, and garam masala. Stir and cook for 30 seconds.
   1. Add the spinach sauce and stir. Cook the mixture over medium-low heat for about 3-4 minutes to deepen the flavors. If it bubbles too much, lower heat to a simmer. Then add coconut milk and stir.
   1. Taste and adjust flavor as needed, adding salt or coconut aminos to deepen the flavor and curry powder for more rich curry flavor.
   1. Serve over your tofu “paneer” and garnish with another drizzle of full fat coconut milk and fresh cilantro. Rice makes a lovely side, as does garlic naan! Store leftovers covered in the refrigerator up to 4-5 days, or in the freezer up to 1 month. Reheat in the microwave or in a rimmed skillet until hot.

* [2019-05-30] Almond butter tofu stir-fry                        :tofu:rice:
  [[https://minimalistbaker.com/almond-butter-tofu-stir-fry/][Original link]]

** Ingredients
*** Tofu
    - 340 g package extra firm tofu

*** Marinade
    - 2 Tbsp sesame oil (divided)
    - 4 Tbsp reduced-sodium tamari (or soy sauce if not GF)
    - 3 Tbsp maple syrup
    - 2 Tbsp almond butter (or sub peanut butter)
    - 2 Tbsp lime juice
    - 1-2 tsp chili garlic sauce (or 1/2 tsp red pepper flake)

*** Veggies
    - 453 g green beans (trimmed)
    - 2-3 small spicy peppers (I used cherry bomb - use bell peppers for less heat)

*** Serving (optional)
    - Brown rice, white rice, or Cauliflower Rice

** Instructions
   1. Preheat oven to 200 degrees C and line a baking sheet with parchment paper. Also wrap tofu in a clean, absorbent towel and set something heavy on top - like a cast-iron skillet - to press out excess moisture.
   1. Once oven is preheated, unwrap tofu and cut into small cubes. Arrange on the lined baking sheet in an even layer and bake for 25-30 minutes or until puffy, dried out, and slightly crispy on the edges (see photo). This step helps crisp up the tofu. The longer you bake it, the firmer and crispier it will get, so adjust cooking time accordingly.
   1. In the meantime, to a small mixing bowl, add half of the sesame oil (1 Tbsp as original recipe is written // adjust if altering batch size), tamari, maple syrup, almond butter, lime juice, and chili garlic sauce/red pepper flake/Thai chilies. Whisk to combine. Then taste and adjust flavor as needed, adding more almond butter for creaminess / nuttiness, tamari for saltiness, lime juice for acidity, or chili garlic sauce for heat. Set aside.
   1. If serving with rice, prepare at this time (see notes).
   1. Add baked tofu to the almond butter-tamari sauce and let marinate for 5 minutes, stirring occasionally. The longer it marinates, the more intense the flavor, but I find 5-10 minutes to be sufficient.
   1. Heat a large skillet over medium heat. Once hot, add the tofu, leaving most of the marinade behind (this will be added to the vegetables for flavor).
   1. Cook for about 5 minutes, stirring occasionally, until browned on all sides and slightly caramelized. Remove from pan and set aside.
   1. To the skillet, add remaining sesame oil (1 Tbsp as original recipe is written // adjust if altering batch size), green beans and peppers and 2-3 Tbsp (30-45 ml // amount as original recipe is written // adjust if altering batch size) of the marinade. Cover to steam for about 4-5 minutes or until green beans are slightly tender. Then remove lid, increase heat to medium high, and add remaining marinade and the tofu. Cook for an additional 1-2 minutes, stirring frequently. Then remove from heat.
   1. Serve as is or over cooked rice or cauliflower rice. For more heat, serve with chili garlic sauce or Sriracha.
   1. Best when fresh. Store leftovers in the refrigerator up to 3 days. Reheat on the stovetop or in the microwave until hot.

* [2019-05-28] Creamy Pasta Soup                                 :pasta:soup:
  [[https://elavegan.com/creamy-pasta-soup-recipe/][Original link]]

** Ingredients
*** For the soup:
    - 1 large (225 g) carrot, peeled and chopped
    - 1-2 stalks (75 g) celery, chopped
    - 200 g broccoli florets
    - 1/2 tbsp oil
    - 1 medium onion, diced
    - 4 garlic cloves, minced
    - 5-6 cups (1200-1400 ml) vegetable broth
    - Spice mix: 2 tsp onion powder, 2 tsp Italian seasoning, 1-2 tsp ground lovage (or to taste), salt and pepper to taste
    - 200 g pasta (I used gluten-free)
    - Fresh herbs to garnish

*** Cashew-Cannellini Cream:
    - One 400g g can white cannellini beans (drained and rinsed)
    - 1/2 cup (75 g) cashews soaked (*see recipe notes)
    - 1 1/2 cups plant-based milk
    - 1 tbsp lemon juice
    - 1/4 tsp salt

