docs/recipes/recipes.html

<div id="outline-container-org2cfc802" class="outline-3">
<h3 id="org2cfc802">Instructions</h3>
<div class="outline-text-3" id="text-org2cfc802">
<ol class="org-ol">
<li>This recipe is all about multi-tasking and is totally doable in 30 minutes. Start by preheating the oven to 210°C and draining your tofu. Then wrap in a clean towel and set something heavy on top. (This step can also be done in advance with a tofu press.)</li>
<li>Cube tofu and add to a medium mixing bowl. Season with curry powder, coconut aminos, sea salt, and nutritional yeast. Shake the bowl to gently toss. Set aside.</li>
<li>Heat a medium oven-safe seasoned cast iron over medium heat (if using a stainless steel skillet, add a little oil so it doesn’t stick). Once hot, add the tofu and sauté for 3-4 minutes, or until a couple of the sides are browned. Then transfer to the hot oven and bake for 15 minutes. If you prefer firmer tofu, bake longer. If you want softer tofu that mocks paneer, bake less. Set aside to rest in the pan.</li>
<li>Fill a large pot halfway full with water and bring to a boil over high heat. While you wait, move on to the next step.</li>
<li>Heat a large rimmed skillet over medium heat. Once hot, add oil and cumin seed, ginger, onion, and serrano pepper. Saute until onion is soft and translucent -- about 5 minutes.</li>
<li>Add diced tomatoes and garlic and stir to combine. Saute for 3-4 minutes, or until the tomato has softened.</li>
<li>Your water should be boiling now. Add spinach and cook uncovered for 2 minutes. Then strain and rinse with cold water. Drain well. Set aside.</li>
<li>Add the tomato mixture to a blender or food processor along with cooked drained spinach and the vegetable broth (or water). Blend into a smooth sauce, scraping down sides as needed. If it has trouble blending, add more vegetable broth or water.</li>
<li>Lastly, cook your sauce. Heat the same rimmed skillet from earlier over medium heat. Once hot, add remaining oil (or some water), curry powder, and garam masala. Stir and cook for 30 seconds.</li>
<li>Add the spinach sauce and stir. Cook the mixture over medium-low heat for about 3-4 minutes to deepen the flavors. If it bubbles too much, lower heat to a simmer. Then add coconut milk and stir.</li>
<li>Taste and adjust flavor as needed, adding salt or coconut aminos to deepen the flavor and curry powder for more rich curry flavor.</li>
<li>Serve over your tofu “paneer” and garnish with another drizzle of full fat coconut milk and fresh cilantro. Rice makes a lovely side, as does garlic naan! Store leftovers covered in the refrigerator up to 4-5 days, or in the freezer up to 1 month. Reheat in the microwave or in a rimmed skillet until hot.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orga5df251" class="outline-2">
<h2 id="orga5df251"><span class="timestamp-wrapper"><span class="timestamp">[2019-05-30 Thu] </span></span> Almond butter tofu stir-fry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tofu">tofu</span>&#xa0;<span class="rice">rice</span></span></h2>
<div class="outline-text-2" id="text-orga5df251">
<p>
<a href="https://minimalistbaker.com/almond-butter-tofu-stir-fry/">Original link</a>
</p>
</div>

<div id="outline-container-org4e9c96b" class="outline-3">
<h3 id="org4e9c96b">Ingredients</h3>
<div class="outline-text-3" id="text-org4e9c96b">
</div>
<div id="outline-container-orga452842" class="outline-4">
<h4 id="orga452842">Tofu</h4>
<div class="outline-text-4" id="text-orga452842">
<ul class="org-ul">
<li>340 g package extra firm tofu</li>
</ul>
</div>
</div>

<div id="outline-container-org61d585c" class="outline-4">
<h4 id="org61d585c">Marinade</h4>
<div class="outline-text-4" id="text-org61d585c">
<ul class="org-ul">
<li>2 Tbsp sesame oil (divided)</li>
<li>4 Tbsp reduced-sodium tamari (or soy sauce if not GF)</li>
<li>3 Tbsp maple syrup</li>
<li>2 Tbsp almond butter (or sub peanut butter)</li>
<li>2 Tbsp lime juice</li>
<li>1-2 tsp chili garlic sauce (or 1/2 tsp red pepper flake)</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb1d82a" class="outline-4">
<h4 id="orgeb1d82a">Veggies</h4>
<div class="outline-text-4" id="text-orgeb1d82a">
<ul class="org-ul">
<li>453 g green beans (trimmed)</li>
<li>2-3 small spicy peppers (I used cherry bomb - use bell peppers for less heat)</li>
</ul>
</div>
</div>

<div id="outline-container-org9b5b70e" class="outline-4">
<h4 id="org9b5b70e">Serving (optional)</h4>
<div class="outline-text-4" id="text-org9b5b70e">
<ul class="org-ul">
<li>Brown rice, white rice, or Cauliflower Rice</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org13c9812" class="outline-3">
<h3 id="org13c9812">Instructions</h3>
<div class="outline-text-3" id="text-org13c9812">
<ol class="org-ol">
<li>Preheat oven to 200 degrees C and line a baking sheet with parchment paper. Also wrap tofu in a clean, absorbent towel and set something heavy on top - like a cast-iron skillet - to press out excess moisture.</li>
<li>Once oven is preheated, unwrap tofu and cut into small cubes. Arrange on the lined baking sheet in an even layer and bake for 25-30 minutes or until puffy, dried out, and slightly crispy on the edges (see photo). This step helps crisp up the tofu. The longer you bake it, the firmer and crispier it will get, so adjust cooking time accordingly.</li>
<li>In the meantime, to a small mixing bowl, add half of the sesame oil (1 Tbsp as original recipe is written // adjust if altering batch size), tamari, maple syrup, almond butter, lime juice, and chili garlic sauce/red pepper flake/Thai chilies. Whisk to combine. Then taste and adjust flavor as needed, adding more almond butter for creaminess / nuttiness, tamari for saltiness, lime juice for acidity, or chili garlic sauce for heat. Set aside.</li>
<li>If serving with rice, prepare at this time (see notes).</li>
<li>Add baked tofu to the almond butter-tamari sauce and let marinate for 5 minutes, stirring occasionally. The longer it marinates, the more intense the flavor, but I find 5-10 minutes to be sufficient.</li>
<li>Heat a large skillet over medium heat. Once hot, add the tofu, leaving most of the marinade behind (this will be added to the vegetables for flavor).</li>
<li>Cook for about 5 minutes, stirring occasionally, until browned on all sides and slightly caramelized. Remove from pan and set aside.</li>
<li>To the skillet, add remaining sesame oil (1 Tbsp as original recipe is written <i>/ adjust if altering batch size), green beans and peppers and 2-3 Tbsp (30-45 ml /</i> amount as original recipe is written // adjust if altering batch size) of the marinade. Cover to steam for about 4-5 minutes or until green beans are slightly tender. Then remove lid, increase heat to medium high, and add remaining marinade and the tofu. Cook for an additional 1-2 minutes, stirring frequently. Then remove from heat.</li>
<li>Serve as is or over cooked rice or cauliflower rice. For more heat, serve with chili garlic sauce or Sriracha.</li>
<li>Best when fresh. Store leftovers in the refrigerator up to 3 days. Reheat on the stovetop or in the microwave until hot.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org8d3f971" class="outline-2">
<h2 id="org8d3f971"><span class="timestamp-wrapper"><span class="timestamp">[2019-05-28 Tue] </span></span> Creamy Pasta Soup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="pasta">pasta</span>&#xa0;<span class="soup">soup</span></span></h2>
<div class="outline-text-2" id="text-org8d3f971">
<p>
<a href="https://elavegan.com/creamy-pasta-soup-recipe/">Original link</a>
</p>
</div>

<div id="outline-container-org3263656" class="outline-3">
<h3 id="org3263656">Ingredients</h3>
<div class="outline-text-3" id="text-org3263656">
</div>
<div id="outline-container-org93ff513" class="outline-4">
<h4 id="org93ff513">For the soup:</h4>
<div class="outline-text-4" id="text-org93ff513">
<ul class="org-ul">
<li>1 large (225 g) carrot, peeled and chopped</li>
<li>1-2 stalks (75 g) celery, chopped</li>
<li>200 g broccoli florets</li>
<li>1/2 tbsp oil</li>
<li>1 medium onion, diced</li>
<li>4 garlic cloves, minced</li>
<li>5-6 cups (1200-1400 ml) vegetable broth</li>
<li>Spice mix: 2 tsp onion powder, 2 tsp Italian seasoning, 1-2 tsp ground lovage (or to taste), salt and pepper to taste</li>
<li>200 g pasta (I used gluten-free)</li>
<li>Fresh herbs to garnish</li>
</ul>
</div>
</div>

<div id="outline-container-orgf58eb6d" class="outline-4">
<h4 id="orgf58eb6d">Cashew-Cannellini Cream:</h4>
<div class="outline-text-4" id="text-orgf58eb6d">
<ul class="org-ul">
<li>One 400g g can white cannellini beans (drained and rinsed)</li>
<li>1/2 cup (75 g) cashews soaked (*see recipe notes)</li>
<li>1 1/2 cups plant-based milk</li>
<li>1 tbsp lemon juice</li>
<li>1/4 tsp salt</li>
</ul>
</div>
</div>
</div>
