org/recipes/recipes.org
** Instructions
   1. Soak cashews for a couple of hours OR boil them for 20 minutes in water until they are soft. Once the cashews are soft, transfer them to a blender, add the cannellini beans, the plant-based milk, lemon juice & salt and blend on high speed for about 2 minutes or until super smooth and creamy. Set aside.
   1. For the soup: Heat oil in a large pot over medium heat, add the onion, all veggies and fry for about 4 minutes. Then add the garlic, the spices and fry for a further minute.
   1. Add in the veggie broth (I first used 5 cups but had to add another cup later). Bring to a boil and then reduce the heat.
   1. Now add the cashew-cannellini cream and stir. Let the soup simmer for about 6-8 minutes.
   1. Finally, add pasta of choice and let the soup simmer for about 8-10 minutes or until the pasta is al-dente (check the package instructions). Stir frequently! If the soup is too thick either add more veggie broth or plant-based milk! Taste and adjust seasoning. You will most likely need to add more salt!
   1. Garnish with fresh herbs and enjoy!

*** Notes
    For a nut-free version, simply use 75 grams of hemp seeds!

* [2019-05-28] Vegetarian Chili                                     :mexican:
  [[https://cookieandkate.com/vegetarian-chili-recipe/][Original link]]

** Ingredients
   - 2 tablespoons extra-virgin olive oil
   - 1 medium red onion, chopped
   - 1 large red bell pepper, chopped
   - 2 medium carrots, chopped
   - 2 ribs celery, chopped
   - ½ teaspoon salt, divided
   - 4 cloves garlic, pressed or minced
   - 2 tablespoons chili powder*
   - 2 teaspoons ground cumin
   - 1 ½ teaspoons smoked paprika*
   - 1 teaspoon dried oregano
   - 1 large can (800 g) or 2 small cans (400 g) diced tomatoes**, with their juices
   - 2 cans (800 g) black beans, rinsed and drained
   - 1 can (400 g) pinto beans, rinsed and drained
   - 2 cups vegetable broth or water
   - 1 bay leaf
   - 2 tablespoons chopped fresh cilantro, plus more for garnishing
   - 1 to 2 teaspoons sherry vinegar or red wine vinegar or lime juice, to taste
   - Garnishes: chopped cilantro, sliced avocado, tortilla chips, sour cream or crème fraîche, grated cheddar cheese, etc.

** Instructions
   1. In a large Dutch oven or heavy-bottomed pot over medium heat, warm the olive oil until shimmering. Add the chopped onion, bell pepper, carrot, celery and ¼ teaspoon of the salt. Stir to combine and cook, stirring occasionally, until the vegetables are tender and the onion is translucent, about 7 to 10 minutes.
   1. Add the garlic, chili powder, cumin, smoked paprika and oregano. Cook until fragrant while stirring constantly, about 1 minute.
   1. Add the diced tomatoes and their juices, the drained black beans and pinto beans, vegetable broth and bay leaf. Stir to combine and let the mixture come to a simmer. Continue cooking, stirring occasionally and reducing heat as necessary to maintain a gentle simmer, for 30 minutes.
   1. Remove the chili from the heat.
   1. For the best texture and flavor, transfer 1 ½ cups of the chili to a blender, making sure to get some of the liquid portion. Securely fasten the lid and blend until smooth (watch out for hot steam), then pour the blended mixture back into the pot. (Or, you can blend the chili briefly with an immersion blender, or mash the chili with a potato masher until it reaches a thicker, more chili-like consistency.)
   1. Add the chopped cilantro, stir to blend, and then mix in the vinegar, to taste. Add salt to taste, too---I added ¼ teaspoon more at this point.
   1. Divide the mixture into individual bowls and serve with garnishes of your choice. This chili will keep well in the refrigerator for about 4 days or you can freeze it for longer-term storage.

* [2019-05-22] Curried Chickpea and Quinoa           :chickpeas:curry:quinoa:
  [[https://naturallyella.com/curried-chickpea-bowls/][Original link]]

** Ingredients
*** Chickpeas
    - 2 teaspoons olive oil
    - 2 shallots, minced
    - 2 cloves garlic, minced
    - 1 tablespoon curry powder
    - 1/2 cup cream or coconut milk
    - 2 cups chickpeas
    - Vegetable broth, as needed
    - Salt, as needed

*** Serving
    - 1 cup cooked quinoa
    - 2 tablespoons parsley
    - 1 to 2 tablespoons lemon juice

** Instructions
   1. Heat a pot or dutch oven over medium-low heat. Add the shallot and cook for 3 to 4 minutes, until soft and fragrant. Stir in the garlic, cooking for another 1 to 2 minutes. Add the curry powder, followed by the cream or coconut milk.
   1. Add the chickpeas and a splash of vegetable broth or water. Cook on low until the chickpeas are hot and tender, 6 to 8 minutes. If needed, add a splash or two of vegetable broth of coconut milk.
   1. Serve the curried chickpeas over the quinoa and sprinkle with parsley/feta. Serve with lemon wedges if desired.

* [2019-05-14] Firecracker Vegan Lettuce Wraps                   :spicy:tofu:
  [[https://pinchofyum.com/vegan-lettuce-wraps][Original link]]

** Ingredients
*** Sauce
    - 1/2 cup peanut butter
    - 1/3 cup low sodium soy sauce
    - 1/3 cup sesame oil
    - 1/4 cup rice vinegar
    - 2 tablespoons chili paste (like sambal oelek) ++ for more
    - firecrackery-ness
    - 2 tablespoons sugar
    - a small knob of fresh ginger, peeled
    - a clove of fresh garlic, peeled

*** Other
    - 1 container extra firm tofu (see notes)
    - 150 g brown rice noodles
    - lettuce leaves for wrapping
    - peanuts, cilantro, lime for serving

