docs/recipes/recipes.html

<div id="outline-container-org7eee25a" class="outline-3">
<h3 id="org7eee25a">Instructions</h3>
<div class="outline-text-3" id="text-org7eee25a">
<ol class="org-ol">
<li>Soak cashews for a couple of hours OR boil them for 20 minutes in water until they are soft. Once the cashews are soft, transfer them to a blender, add the cannellini beans, the plant-based milk, lemon juice &amp; salt and blend on high speed for about 2 minutes or until super smooth and creamy. Set aside.</li>
<li>For the soup: Heat oil in a large pot over medium heat, add the onion, all veggies and fry for about 4 minutes. Then add the garlic, the spices and fry for a further minute.</li>
<li>Add in the veggie broth (I first used 5 cups but had to add another cup later). Bring to a boil and then reduce the heat.</li>
<li>Now add the cashew-cannellini cream and stir. Let the soup simmer for about 6-8 minutes.</li>
<li>Finally, add pasta of choice and let the soup simmer for about 8-10 minutes or until the pasta is al-dente (check the package instructions). Stir frequently! If the soup is too thick either add more veggie broth or plant-based milk! Taste and adjust seasoning. You will most likely need to add more salt!</li>
<li>Garnish with fresh herbs and enjoy!</li>
</ol>
</div>

<div id="outline-container-org5c2452a" class="outline-4">
<h4 id="org5c2452a">Notes</h4>
<div class="outline-text-4" id="text-org5c2452a">
<p>
For a nut-free version, simply use 75 grams of hemp seeds!
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org12cff5e" class="outline-2">
<h2 id="org12cff5e"><span class="timestamp-wrapper"><span class="timestamp">[2019-05-28 Tue] </span></span> Vegetarian Chili&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mexican">mexican</span></span></h2>
<div class="outline-text-2" id="text-org12cff5e">
<p>
<a href="https://cookieandkate.com/vegetarian-chili-recipe/">Original link</a>
</p>
</div>

<div id="outline-container-org84c266b" class="outline-3">
<h3 id="org84c266b">Ingredients</h3>
<div class="outline-text-3" id="text-org84c266b">
<ul class="org-ul">
<li>2 tablespoons extra-virgin olive oil</li>
<li>1 medium red onion, chopped</li>
<li>1 large red bell pepper, chopped</li>
<li>2 medium carrots, chopped</li>
<li>2 ribs celery, chopped</li>
<li>½ teaspoon salt, divided</li>
<li>4 cloves garlic, pressed or minced</li>
<li>2 tablespoons chili powder*</li>
<li>2 teaspoons ground cumin</li>
<li>1 ½ teaspoons smoked paprika*</li>
<li>1 teaspoon dried oregano</li>
<li>1 large can (800 g) or 2 small cans (400 g) diced tomatoes**, with their juices</li>
<li>2 cans (800 g) black beans, rinsed and drained</li>
<li>1 can (400 g) pinto beans, rinsed and drained</li>
<li>2 cups vegetable broth or water</li>
<li>1 bay leaf</li>
<li>2 tablespoons chopped fresh cilantro, plus more for garnishing</li>
<li>1 to 2 teaspoons sherry vinegar or red wine vinegar or lime juice, to taste</li>
<li>Garnishes: chopped cilantro, sliced avocado, tortilla chips, sour cream or crème fraîche, grated cheddar cheese, etc.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd76b4e2" class="outline-3">
<h3 id="orgd76b4e2">Instructions</h3>
<div class="outline-text-3" id="text-orgd76b4e2">
<ol class="org-ol">
<li>In a large Dutch oven or heavy-bottomed pot over medium heat, warm the olive oil until shimmering. Add the chopped onion, bell pepper, carrot, celery and ¼ teaspoon of the salt. Stir to combine and cook, stirring occasionally, until the vegetables are tender and the onion is translucent, about 7 to 10 minutes.</li>
<li>Add the garlic, chili powder, cumin, smoked paprika and oregano. Cook until fragrant while stirring constantly, about 1 minute.</li>
<li>Add the diced tomatoes and their juices, the drained black beans and pinto beans, vegetable broth and bay leaf. Stir to combine and let the mixture come to a simmer. Continue cooking, stirring occasionally and reducing heat as necessary to maintain a gentle simmer, for 30 minutes.</li>
<li>Remove the chili from the heat.</li>
<li>For the best texture and flavor, transfer 1 ½ cups of the chili to a blender, making sure to get some of the liquid portion. Securely fasten the lid and blend until smooth (watch out for hot steam), then pour the blended mixture back into the pot. (Or, you can blend the chili briefly with an immersion blender, or mash the chili with a potato masher until it reaches a thicker, more chili-like consistency.)</li>
<li>Add the chopped cilantro, stir to blend, and then mix in the vinegar, to taste. Add salt to taste, too&#x2014;I added ¼ teaspoon more at this point.</li>
<li>Divide the mixture into individual bowls and serve with garnishes of your choice. This chili will keep well in the refrigerator for about 4 days or you can freeze it for longer-term storage.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgc2b2c0e" class="outline-2">
<h2 id="orgc2b2c0e"><span class="timestamp-wrapper"><span class="timestamp">[2019-05-22 Wed] </span></span> Curried Chickpea and Quinoa&#xa0;&#xa0;&#xa0;<span class="tag"><span class="chickpeas">chickpeas</span>&#xa0;<span class="curry">curry</span>&#xa0;<span class="quinoa">quinoa</span></span></h2>
<div class="outline-text-2" id="text-orgc2b2c0e">
<p>
<a href="https://naturallyella.com/curried-chickpea-bowls/">Original link</a>
</p>
</div>

<div id="outline-container-orgb24cfb5" class="outline-3">
<h3 id="orgb24cfb5">Ingredients</h3>
<div class="outline-text-3" id="text-orgb24cfb5">
</div>
<div id="outline-container-orgd14930e" class="outline-4">
<h4 id="orgd14930e">Chickpeas</h4>
<div class="outline-text-4" id="text-orgd14930e">
<ul class="org-ul">
<li>2 teaspoons olive oil</li>
<li>2 shallots, minced</li>
<li>2 cloves garlic, minced</li>
<li>1 tablespoon curry powder</li>
<li>1/2 cup cream or coconut milk</li>
<li>2 cups chickpeas</li>
<li>Vegetable broth, as needed</li>
<li>Salt, as needed</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd85799" class="outline-4">
<h4 id="orgdd85799">Serving</h4>
<div class="outline-text-4" id="text-orgdd85799">
<ul class="org-ul">
<li>1 cup cooked quinoa</li>
<li>2 tablespoons parsley</li>
<li>1 to 2 tablespoons lemon juice</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org71c2dee" class="outline-3">
<h3 id="org71c2dee">Instructions</h3>
<div class="outline-text-3" id="text-org71c2dee">
<ol class="org-ol">
<li>Heat a pot or dutch oven over medium-low heat. Add the shallot and cook for 3 to 4 minutes, until soft and fragrant. Stir in the garlic, cooking for another 1 to 2 minutes. Add the curry powder, followed by the cream or coconut milk.</li>
<li>Add the chickpeas and a splash of vegetable broth or water. Cook on low until the chickpeas are hot and tender, 6 to 8 minutes. If needed, add a splash or two of vegetable broth of coconut milk.</li>
<li>Serve the curried chickpeas over the quinoa and sprinkle with parsley/feta. Serve with lemon wedges if desired.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgb14d731" class="outline-2">
<h2 id="orgb14d731"><span class="timestamp-wrapper"><span class="timestamp">[2019-05-14 Tue] </span></span> Firecracker Vegan Lettuce Wraps&#xa0;&#xa0;&#xa0;<span class="tag"><span class="spicy">spicy</span>&#xa0;<span class="tofu">tofu</span></span></h2>
<div class="outline-text-2" id="text-orgb14d731">
<p>
<a href="https://pinchofyum.com/vegan-lettuce-wraps">Original link</a>
</p>
</div>

<div id="outline-container-orgc0b7372" class="outline-3">
<h3 id="orgc0b7372">Ingredients</h3>
<div class="outline-text-3" id="text-orgc0b7372">
</div>
<div id="outline-container-orgf3ecaa7" class="outline-4">
<h4 id="orgf3ecaa7">Sauce</h4>
<div class="outline-text-4" id="text-orgf3ecaa7">
<ul class="org-ul">
<li>1/2 cup peanut butter</li>
<li>1/3 cup low sodium soy sauce</li>
<li>1/3 cup sesame oil</li>
<li>1/4 cup rice vinegar</li>
<li>2 tablespoons chili paste (like sambal oelek) ++ for more</li>
<li>firecrackery-ness</li>
<li>2 tablespoons sugar</li>
<li>a small knob of fresh ginger, peeled</li>
<li>a clove of fresh garlic, peeled</li>
</ul>
</div>
</div>

<div id="outline-container-org25edb77" class="outline-4">
<h4 id="org25edb77">Other</h4>
<div class="outline-text-4" id="text-org25edb77">
<ul class="org-ul">
<li>1 container extra firm tofu (see notes)</li>
<li>150 g brown rice noodles</li>
<li>lettuce leaves for wrapping</li>
<li>peanuts, cilantro, lime for serving</li>
</ul>
</div>
</div>
</div>
