org/recipes/recipes.org
** Instructions
   1. Noodle Prep: Soak your noodles in a bowl of lukewarm water for at least 30 minutes while prepping the rest of the recipe. You want the noodles to be soft and flexible.
   2. Sauce: Blend all the sauce ingredients together in a small blender or food processor until smooth and creamy.
   3. Tofu: Press the tofu with a few paper towels to get some of the moisture out. Cut the tofu into small pieces. Heat a little oil in a nonstick skillet. Add your tofu. Stir-fry until golden brown. I usually let it sauté for at least 15 minutes. Add about half of the sauce to the pan. Stir-fry for another 3-5 minutes. As the sauce browns, it will form small crispy pieces around the tofu. Yum! Transfer tofu to a bowl.
   4. Noodles: Drain and rinse your noodles. Add another swish of oil to the pan and plop the noodles in. Add about half of the remaining sauce. Stir fry for just a minute or two until coated. Add a splash of water if it's too sticky. Remove from heat immediately and toss with the tofu.
   5. Lettuce Wrap It Up: Fill your butter lettuce leaves with the noodle/tofu mixture (it's okay if it's sticky -- you're just wrapping it up in lettuce). Top with peanuts, cashews, cilantro, scallions, lime, and/or Sriracha if you want.

* [2019-05-12] Curried Sweet Potato and Lentil Soup            :soup:lentils:
  [[http://leitesculinaria.com/106497/recipes-curried-sweet-potato-and-lentil-soup.html][Original link]]

** Ingredients
   - 500g sweet potatoes (1 to 2 sweet potatoes)
   - 2 cups (350 grams) red split lentils
   - 1 to 2 teaspoons mild olive or vegetable oil
   - 1 1/2 to 3 tablespoons (up to 112 grams) red curry paste
   - 6 1/2 cups (1.5 liters) stock (whether beef stockor chicken stock or
   - vegetable stock), plus more as needed
   - Juice of 2 limes (3 to 4 tablespoons)
   - Coarse black pepper
   - Sea salt flakes
   - Cilantro, crushed peanuts, or coconut milk for garnish (optional)

** Instructions
   1. Peel the sweet potatoes and chop them into 1/2-inch (1-cm) dice.
   2. Rinse the lentils in a sieve under cold running water until the water runs clear.
   3. Heat a large saucepan or pot---one that has a lid--- over medium-high heat. Add the oil and red curry paste and stir-fry just until it becomes strongly aromatic, about 1 minute. If you like things with just a mild heat, add just 1 1/2 tablespoons red curry paste. If you like things hotter, opt for 2 to 3 tablespoons red curry paste.
   4. Add the potato and lentils and stir to coat them with the paste. Pour in the stock and bring everything to a boil. Reduce the heat to a very gentle simmer, cover, and gently simmer just until the lentils and sweet potato are soft, 25 to 35 minutes. Remove from the heat.
   5. If using a blender or food processor, let the soup cool for at least 10 minutes and then carefully ladle it into a food processor and blitz until smooth, working in batches if necessary. The soup will be quite thick. If a thinner soup is desired, add stock as necessary. Return the soup to the pan and, if necessary, rewarm over low heat. If using an immersion or stick blender, stick the blender straight in the pot and puree until smooth. If a thinner soup is desired, add stock as necessary. If necessary, rewarm over low heat.
   6. Add a generous pinch of pepper and the lime juice to the soup and stir to combine. Serve immediately and, if desired, garnish with cilantro, peanuts, or a drizzle of coconut milk. Serve immediately (As with most soups, this freezes just fine in an airtight container or portioned in individual servings in resealable plastic bags. Defrost and rewarm over low heat before serving. Keep in mind that the soup will thicken in the fridge or freezer, so you'll need to add more stock or water when rewarming it to attain the original consistency.)

* [2019-04-09] Vegan Meatballs with Gravy                              :rice:
  [[https://elavegan.com/vegan-meatballs-gravy-gluten-free-recipe/][Original link]]

** Ingredients
*** Vegan meatballs:
    - One 400 g can black beans , drained and rinsed (250 g)
    - 1/4 cup sunflower seeds (35 g)
    - 1/2 cup oats (gluten-free if needed) (45 g)
    - 2 tbsp tomato paste (60 g)
    - 2 cloves of garlic
    - 1/2 large onion, chopped
    - 2 tbsp ground chia seeds or flax seeds
    - Spice mix: 1/2 tbsp onion powder, 1 tsp garlic powder, 1 tsp ground
    - oregano, 1 tsp ground cumin, 1/2 tsp smoked paprika, 1/4 tsp red pepper
    - flakes
    - Sea salt and pepper to taste
    - Oil for frying

*** Mashed taters:
    - 6 medium-sized potatoes
    - 1/4 cup coconut milk canned (60 ml) (*see recipe notes)
    - 1/2 tsp nutmeg (or more/less to taste)
    - black pepper, sea salt to taste

*** Gravy:
    - 1 1/2 cups vegetable broth or water (360 ml)
    - 1/3 cup plant-based cream or canned coconut milk (80 ml)
    - 2 tbsp tomato paste (60 g)
    - 1/2 tsp fresh ginger (minced)
    - Ground spice mix: 3 tsp curry powder, 1 1/2 tsp onion powder, 1 tsp
    - garlic powder, 1 tsp oregano, 1 tsp cumin, 1 tsp turmeric, 1/2 tsp
    - nutmeg, 1/2 tsp smoked paprika, 1/4 tsp red pepper flakes, 1 tsp coconut
    - sugar (or brown sugar), sea salt and pepper to taste
    - 1 tbsp cornstarch (to thicken)
    - Fresh parsley to garnish

** Instructions
   1. Preheat oven to 390 degrees F (200 degrees C).
   2. Prepare mashed potatoes as described in this recipe or make your favorite pasta or rice (whatever you want to serve with your vegan meatballs).

*** Meatballs:
    1. Put all ingredients (except oil) to a food processor or blender and pulse a couple of times. Scrape down the sides and pulse again. Repeat for about one minute or until the mixture sticks together.
    2. Roll the mixture with your hands into balls. I used 1 tbsp per ball (the recipe makes about 15 balls).
    3. Heat 2-3 tbsp oil in a pan/skillet and fry balls for about 6-8 minutes over medium heat. Shake the pan from time to time to fry the balls evenly from all sides.
    4. Transfer the balls to a baking sheet and bake in the oven for about 20 minutes.

*** Mashed taters:
    1. Peel and chop potatoes, transfer them to a pot with salted water and bring to a boil.
    2. Cook on medium heat for about 15 minutes or until tender, drain.
    3. Transfer back to the pot, add coconut milk, nutmeg, black pepper and sea salt to taste and mash with a potato masher (don't use a food processor or blender).

