docs/recipes/recipes.html

<div id="outline-container-org72e54be" class="outline-3">
<h3 id="org72e54be">Instructions</h3>
<div class="outline-text-3" id="text-org72e54be">
<ol class="org-ol">
<li>Noodle Prep: Soak your noodles in a bowl of lukewarm water for at least 30 minutes while prepping the rest of the recipe. You want the noodles to be soft and flexible.</li>
<li>Sauce: Blend all the sauce ingredients together in a small blender or food processor until smooth and creamy.</li>
<li>Tofu: Press the tofu with a few paper towels to get some of the moisture out. Cut the tofu into small pieces. Heat a little oil in a nonstick skillet. Add your tofu. Stir-fry until golden brown. I usually let it sauté for at least 15 minutes. Add about half of the sauce to the pan. Stir-fry for another 3-5 minutes. As the sauce browns, it will form small crispy pieces around the tofu. Yum! Transfer tofu to a bowl.</li>
<li>Noodles: Drain and rinse your noodles. Add another swish of oil to the pan and plop the noodles in. Add about half of the remaining sauce. Stir fry for just a minute or two until coated. Add a splash of water if it's too sticky. Remove from heat immediately and toss with the tofu.</li>
<li>Lettuce Wrap It Up: Fill your butter lettuce leaves with the noodle/tofu mixture (it's okay if it's sticky &#x2013; you're just wrapping it up in lettuce). Top with peanuts, cashews, cilantro, scallions, lime, and/or Sriracha if you want.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org34267dd" class="outline-2">
<h2 id="org34267dd"><span class="timestamp-wrapper"><span class="timestamp">[2019-05-12 Sun] </span></span> Curried Sweet Potato and Lentil Soup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="soup">soup</span>&#xa0;<span class="lentils">lentils</span></span></h2>
<div class="outline-text-2" id="text-org34267dd">
<p>
<a href="http://leitesculinaria.com/106497/recipes-curried-sweet-potato-and-lentil-soup.html">Original link</a>
</p>
</div>

<div id="outline-container-orgbee7931" class="outline-3">
<h3 id="orgbee7931">Ingredients</h3>
<div class="outline-text-3" id="text-orgbee7931">
<ul class="org-ul">
<li>500g sweet potatoes (1 to 2 sweet potatoes)</li>
<li>2 cups (350 grams) red split lentils</li>
<li>1 to 2 teaspoons mild olive or vegetable oil</li>
<li>1 1/2 to 3 tablespoons (up to 112 grams) red curry paste</li>
<li>6 1/2 cups (1.5 liters) stock (whether beef stockor chicken stock or</li>
<li>vegetable stock), plus more as needed</li>
<li>Juice of 2 limes (3 to 4 tablespoons)</li>
<li>Coarse black pepper</li>
<li>Sea salt flakes</li>
<li>Cilantro, crushed peanuts, or coconut milk for garnish (optional)</li>
</ul>
</div>
</div>

<div id="outline-container-orgb9c4c31" class="outline-3">
<h3 id="orgb9c4c31">Instructions</h3>
<div class="outline-text-3" id="text-orgb9c4c31">
<ol class="org-ol">
<li>Peel the sweet potatoes and chop them into 1/2-inch (1-cm) dice.</li>
<li>Rinse the lentils in a sieve under cold running water until the water runs clear.</li>
<li>Heat a large saucepan or pot&#x2014;one that has a lid&#x2014; over medium-high heat. Add the oil and red curry paste and stir-fry just until it becomes strongly aromatic, about 1 minute. If you like things with just a mild heat, add just 1 1/2 tablespoons red curry paste. If you like things hotter, opt for 2 to 3 tablespoons red curry paste.</li>
<li>Add the potato and lentils and stir to coat them with the paste. Pour in the stock and bring everything to a boil. Reduce the heat to a very gentle simmer, cover, and gently simmer just until the lentils and sweet potato are soft, 25 to 35 minutes. Remove from the heat.</li>
<li>If using a blender or food processor, let the soup cool for at least 10 minutes and then carefully ladle it into a food processor and blitz until smooth, working in batches if necessary. The soup will be quite thick. If a thinner soup is desired, add stock as necessary. Return the soup to the pan and, if necessary, rewarm over low heat. If using an immersion or stick blender, stick the blender straight in the pot and puree until smooth. If a thinner soup is desired, add stock as necessary. If necessary, rewarm over low heat.</li>
<li>Add a generous pinch of pepper and the lime juice to the soup and stir to combine. Serve immediately and, if desired, garnish with cilantro, peanuts, or a drizzle of coconut milk. Serve immediately (As with most soups, this freezes just fine in an airtight container or portioned in individual servings in resealable plastic bags. Defrost and rewarm over low heat before serving. Keep in mind that the soup will thicken in the fridge or freezer, so you'll need to add more stock or water when rewarming it to attain the original consistency.)</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org0b5677f" class="outline-2">
<h2 id="org0b5677f"><span class="timestamp-wrapper"><span class="timestamp">[2019-04-09 Tue] </span></span> Vegan Meatballs with Gravy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rice">rice</span></span></h2>
<div class="outline-text-2" id="text-org0b5677f">
<p>
<a href="https://elavegan.com/vegan-meatballs-gravy-gluten-free-recipe/">Original link</a>
</p>
</div>

<div id="outline-container-org3aa9f25" class="outline-3">
<h3 id="org3aa9f25">Ingredients</h3>
<div class="outline-text-3" id="text-org3aa9f25">
</div>
<div id="outline-container-orgd921e53" class="outline-4">
<h4 id="orgd921e53">Vegan meatballs:</h4>
<div class="outline-text-4" id="text-orgd921e53">
<ul class="org-ul">
<li>One 400 g can black beans , drained and rinsed (250 g)</li>
<li>1/4 cup sunflower seeds (35 g)</li>
<li>1/2 cup oats (gluten-free if needed) (45 g)</li>
<li>2 tbsp tomato paste (60 g)</li>
<li>2 cloves of garlic</li>
<li>1/2 large onion, chopped</li>
<li>2 tbsp ground chia seeds or flax seeds</li>
<li>Spice mix: 1/2 tbsp onion powder, 1 tsp garlic powder, 1 tsp ground</li>
<li>oregano, 1 tsp ground cumin, 1/2 tsp smoked paprika, 1/4 tsp red pepper</li>
<li>flakes</li>
<li>Sea salt and pepper to taste</li>
<li>Oil for frying</li>
</ul>
</div>
</div>

<div id="outline-container-org906a7e3" class="outline-4">
<h4 id="org906a7e3">Mashed taters:</h4>
<div class="outline-text-4" id="text-org906a7e3">
<ul class="org-ul">
<li>6 medium-sized potatoes</li>
<li>1/4 cup coconut milk canned (60 ml) (*see recipe notes)</li>
<li>1/2 tsp nutmeg (or more/less to taste)</li>
<li>black pepper, sea salt to taste</li>
</ul>
</div>
</div>

<div id="outline-container-orgd62d0c2" class="outline-4">
<h4 id="orgd62d0c2">Gravy:</h4>
<div class="outline-text-4" id="text-orgd62d0c2">
<ul class="org-ul">
<li>1 1/2 cups vegetable broth or water (360 ml)</li>
<li>1/3 cup plant-based cream or canned coconut milk (80 ml)</li>
<li>2 tbsp tomato paste (60 g)</li>
<li>1/2 tsp fresh ginger (minced)</li>
<li>Ground spice mix: 3 tsp curry powder, 1 1/2 tsp onion powder, 1 tsp</li>
<li>garlic powder, 1 tsp oregano, 1 tsp cumin, 1 tsp turmeric, 1/2 tsp</li>
<li>nutmeg, 1/2 tsp smoked paprika, 1/4 tsp red pepper flakes, 1 tsp coconut</li>
<li>sugar (or brown sugar), sea salt and pepper to taste</li>
<li>1 tbsp cornstarch (to thicken)</li>
<li>Fresh parsley to garnish</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd714078" class="outline-3">
<h3 id="orgd714078">Instructions</h3>
<div class="outline-text-3" id="text-orgd714078">
<ol class="org-ol">
<li>Preheat oven to 390 degrees F (200 degrees C).</li>
<li>Prepare mashed potatoes as described in this recipe or make your favorite pasta or rice (whatever you want to serve with your vegan meatballs).</li>
</ol>
</div>

<div id="outline-container-orgf489a0a" class="outline-4">
<h4 id="orgf489a0a">Meatballs:</h4>
<div class="outline-text-4" id="text-orgf489a0a">
<ol class="org-ol">
<li>Put all ingredients (except oil) to a food processor or blender and pulse a couple of times. Scrape down the sides and pulse again. Repeat for about one minute or until the mixture sticks together.</li>
<li>Roll the mixture with your hands into balls. I used 1 tbsp per ball (the recipe makes about 15 balls).</li>
<li>Heat 2-3 tbsp oil in a pan/skillet and fry balls for about 6-8 minutes over medium heat. Shake the pan from time to time to fry the balls evenly from all sides.</li>
<li>Transfer the balls to a baking sheet and bake in the oven for about 20 minutes.</li>
</ol>
</div>
</div>

<div id="outline-container-org5c97b15" class="outline-4">
<h4 id="org5c97b15">Mashed taters:</h4>
<div class="outline-text-4" id="text-org5c97b15">
<ol class="org-ol">
<li>Peel and chop potatoes, transfer them to a pot with salted water and bring to a boil.</li>
<li>Cook on medium heat for about 15 minutes or until tender, drain.</li>
<li>Transfer back to the pot, add coconut milk, nutmeg, black pepper and sea salt to taste and mash with a potato masher (don't use a food processor or blender).</li>
</ol>
</div>
</div>
