org/recipes/recipes.org
*** Gravy:
    1. To make the gravy, simply add the tomato paste to a pan (use the same pan which you used for the vegan meatballs), pour in the plant-based cream and stir with a whisk to smooth out the tomato paste. Then slowly add the vegetable broth while stirring.
    2. Bring the sauce to a boil, add all other ingredients (except cornstarch and fresh parsley) and let simmer over medium heat for about 10-12 minutes (the longer you simmer the gravy, the more flavorful and thicker it will be).
    3. In a small bowl mix cornstarch with a little bit of water and add it to the pan. The gravy will get a little bit thicker. Keep simmering for a further 2-3 minutes.
    4. Pour the gravy over the vegan meatballs and serve with either mashed potatoes, pasta or rice! Store leftovers of the gravy in a container in the fridge (can be kept in the fridge for about 3-4 days).

* [2019-02-19] Coconut Chana Saag                      :curry:rice:chickpeas:

** Ingredients
   - 2 tablespoons coconut oil
   - 1 onion
   - 3 cloves garlic
   - 2 tablespoons minced ginger
   - 2 tablespoons curry powder - need more
   - 1 teaspoon salt
   - Black pepper
   - 1/2 teaspoon anise seed (or crushed fennel seeds) - need more
   - 1/2 teaspoon garam masala
   - 1/2 teaspoon ground cumin
   - 1/2 teaspoon cayenne
   - 1 can whole tomatoes
   - 2 cans chickpeas
   - 200g chopped kale
   - 1 can coconut milk
   - 2 tablespoons lime juice
   - Basmati rice, mango chutney, coriander for serving

** Instructions
   1. Preheat pot over medium heat and add coconut oil and onions. Saute for 5-7 min
   2. Add garlic, ginger and cook for 30s, before adding curry powder, salt, pepper, anise seeds, garam masala, cumin, cayenne. Toast spices for a bit
   3. Add tomato juice from can and mix in. Then squish the tomatos in your hand to mash them and add to pot. Add chick peas also
   4. Cover pan and simmer for 10 min, stirring occasionally
   5. Stir in kale until wilted then simmer for another 5 min
   6. Add coconut milk and heat through. Add lime juice and season
   7. Serve with rice, chutney and corriander

* [2019-02-07] 1 Pot Lentil Dal                               :rice:noexport:
  [[https://minimalistbaker.com/1-pot-lentil-dal/][Original link]]

** Ingredients
   - Rice
   - 2 Tbsp (30 g) coconut oil*
   - optional: 1 small green chili
   - 1 Tbsp (3 g) minced fresh ginger
   - 1 shallot, thinly sliced
   - 3 cloves garlic, minced (1.5 Tbsp or 9 g)
   - 4 Tbsp (60 g) Green Curry Paste (DIY or store-bought)
   - 2 1/4 cups (540 ml) light coconut milk* (canned is best)
   - 1 tsp ground turmeric
   - 1 tsp curry powder (store-bought or DIY)
   - Pinch each sea salt + black pepper
   - 1 cup (192 g) green lentils*, well rinsed and drained
   - 1 tsp coconut aminos or tamari (or soy sauce if not GF)
   - 1-2 Tbsp (12-24 g) coconut sugar or maple syrup (or other sweetener to taste)
   - 2 Tbsp (30 ml) fresh lemon juice
   - optional: pinch cayenne pepper (for more heat), cilantro and lemon/lime wedges

** Instructions
   1. Set rice cooking
   2. Heat a large pot over medium heat. Once hot, add coconut oil, green chili (optional), ginger, shallot, and garlic. Sauté for 3-4 minutes, stirring occasionally. Reduce heat if browning too quickly.
   3. Add curry paste and stir to coat. Sauté for another 2-3 minutes. Then add coconut milk, turmeric, curry powder, salt, and pepper. Stir to combine.
   4. Bring to a simmer over medium heat. Once simmering, add the lentils, coconut aminos (or tamari), coconut sugar (or maple syrup), and lemon juice and stir.
   5. Bring the mixture back to a simmer, and then reduce heat to low or medium-low and continue gently simmering for 15-20 minutes or until lentils are tender.
   6. Once the lentils are tender, taste and adjust flavor as needed, adding more lemon juice for acidity, a pinch of cayenne for heat (optional), curry powder or paste for more intense curry flavor, salt for saltiness, or coconut sugar or maple syrup for sweetness. The curry should be equally tangy and salty with a hint of sweetness and spice.
   7. Serve the dal as is or over rice of choice (I love white or brown rice, but it's also delicious over cauliflower rice). Garnish with lemon or lime wedges and cilantro (optional).
   8. Store leftovers in the refrigerator up to 4-5 days or in the freezer for 1 month.

* [2018-09-08] Pizza Dough                                            :bread:
  [[https://www.mom4real.com/homemade-pizza-dough-recipe/][Original link]]

** Ingredients
   - 3.5 Cups Bread or All-Purpose Flour
   - 1 Teaspoon Sugar
   - 1 Envelope Instant Dry Yeast
   - 2 Teaspoons Kosher Salt
   - 1.5 Cups Warm Water
   - 2 Tablespoons Olive Oil

** Instructions
   1. Mix together flour, sugar, dry yeast and kosher salt. Slowly add water and olive oil. Mix together until dough forms into a ball. If the dough is too sticky, add a tablespoon of flour until it forms a ball. If the dough is too dry, add a tablespoon of warm water until it forms a ball. Once your dough is formed, knead into a smooth firm ball on a floured surface.
   2. Grease a large bowl with olive oil and place your dough in the bowl. Cover with plastic wrap, and let sit for at least an hour.
   3. The dough will double in size. Now flour your surface and cut the dough in half. Place a damp cloth over the dough and allow it to sit for 10 minutes. Now it's time to roll your dough out into whatever shape you like, while gently pulling the dough to stretch it.

* [2018-08-24] My overnight oats                                  :breakfast:

** Ingredients
   - 1 banana
   - 1/2 cup of rolled oats
   - 3/4 cup of oat milk
   - Shredded coconut
   - 1 teaspoon of chia seeds
   - 1-2 chopped dates

** Instructions
   1. Mush banana at the base of a glass jar
   2. Add all other ingredients and mix

* [2018-08-18] Chickpea Carrot Patties                              :patties:

** Ingredients
   - 1 carrot
   - 1 clove garlic
   - 1 can chickpeas
   - 1.5 tsp ground cumin
   - 1.5 tsp parsley
   - Salt + pepper
   - 1 large egg (or aquafaba)
   - 2 tbsp plain flour

** Instructions
   1. Grate carrot coarsely and put aside
   2. Combine chickpeas, garlic, spices on food processor. Slightly process into rough paste
   3. Add carrot, egg, flour. Process until blended, but rugged
   4. Fry 2-3 minutes each side

* [2018-08-03] Coconut Curry Lentil Soup                               :soup:
  [[http://vegangela.com/2014/01/09/coconut-curry-lentil-soup/][Original link]]

** Ingredients
   - 1 tbsp coconut oil (or olive oil)
   - 1 large onion, chopped
   - 2 cloves garlic, minced
   - 1 tbsp fresh ginger, minced
   - 2 tbsp tomato paste (or ketchup)
   - 2 tbsp curry powder
   - ½ tsp hot red pepper flakes
   - 4 cups vegetable broth
   - 1 400ml can coconut milk
   - 1 400g can diced tomatoes
   - 1.5 cups dry red lentils
   - 2-3 handfuls of chopped kale or spinach
   - salt and pepper, to taste
   - Garnish: chopped cilantro (fresh coriander) and/or vegan sour cream

