docs/recipes/recipes.html

<div id="outline-container-org2c6b8b1" class="outline-4">
<h4 id="org2c6b8b1">Gravy:</h4>
<div class="outline-text-4" id="text-org2c6b8b1">
<ol class="org-ol">
<li>To make the gravy, simply add the tomato paste to a pan (use the same pan which you used for the vegan meatballs), pour in the plant-based cream and stir with a whisk to smooth out the tomato paste. Then slowly add the vegetable broth while stirring.</li>
<li>Bring the sauce to a boil, add all other ingredients (except cornstarch and fresh parsley) and let simmer over medium heat for about 10-12 minutes (the longer you simmer the gravy, the more flavorful and thicker it will be).</li>
<li>In a small bowl mix cornstarch with a little bit of water and add it to the pan. The gravy will get a little bit thicker. Keep simmering for a further 2-3 minutes.</li>
<li>Pour the gravy over the vegan meatballs and serve with either mashed potatoes, pasta or rice! Store leftovers of the gravy in a container in the fridge (can be kept in the fridge for about 3-4 days).</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-orga106b89" class="outline-2">
<h2 id="orga106b89"><span class="timestamp-wrapper"><span class="timestamp">[2019-02-19 Tue] </span></span> Coconut Chana Saag&#xa0;&#xa0;&#xa0;<span class="tag"><span class="curry">curry</span>&#xa0;<span class="rice">rice</span>&#xa0;<span class="chickpeas">chickpeas</span></span></h2>
<div class="outline-text-2" id="text-orga106b89">
</div>
<div id="outline-container-orgcec7a70" class="outline-3">
<h3 id="orgcec7a70">Ingredients</h3>
<div class="outline-text-3" id="text-orgcec7a70">
<ul class="org-ul">
<li>2 tablespoons coconut oil</li>
<li>1 onion</li>
<li>3 cloves garlic</li>
<li>2 tablespoons minced ginger</li>
<li>2 tablespoons curry powder - need more</li>
<li>1 teaspoon salt</li>
<li>Black pepper</li>
<li>1/2 teaspoon anise seed (or crushed fennel seeds) - need more</li>
<li>1/2 teaspoon garam masala</li>
<li>1/2 teaspoon ground cumin</li>
<li>1/2 teaspoon cayenne</li>
<li>1 can whole tomatoes</li>
<li>2 cans chickpeas</li>
<li>200g chopped kale</li>
<li>1 can coconut milk</li>
<li>2 tablespoons lime juice</li>
<li>Basmati rice, mango chutney, coriander for serving</li>
</ul>
</div>
</div>

<div id="outline-container-orgf5a6c1e" class="outline-3">
<h3 id="orgf5a6c1e">Instructions</h3>
<div class="outline-text-3" id="text-orgf5a6c1e">
<ol class="org-ol">
<li>Preheat pot over medium heat and add coconut oil and onions. Saute for 5-7 min</li>
<li>Add garlic, ginger and cook for 30s, before adding curry powder, salt, pepper, anise seeds, garam masala, cumin, cayenne. Toast spices for a bit</li>
<li>Add tomato juice from can and mix in. Then squish the tomatos in your hand to mash them and add to pot. Add chick peas also</li>
<li>Cover pan and simmer for 10 min, stirring occasionally</li>
<li>Stir in kale until wilted then simmer for another 5 min</li>
<li>Add coconut milk and heat through. Add lime juice and season</li>
<li>Serve with rice, chutney and corriander</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org71970b2" class="outline-2">
<h2 id="org71970b2"><span class="timestamp-wrapper"><span class="timestamp">[2018-09-08 Sat] </span></span> Pizza Dough&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bread">bread</span></span></h2>
<div class="outline-text-2" id="text-org71970b2">
<p>
<a href="https://www.mom4real.com/homemade-pizza-dough-recipe/">Original link</a>
</p>
</div>

<div id="outline-container-orgbc6544c" class="outline-3">
<h3 id="orgbc6544c">Ingredients</h3>
<div class="outline-text-3" id="text-orgbc6544c">
<ul class="org-ul">
<li>3.5 Cups Bread or All-Purpose Flour</li>
<li>1 Teaspoon Sugar</li>
<li>1 Envelope Instant Dry Yeast</li>
<li>2 Teaspoons Kosher Salt</li>
<li>1.5 Cups Warm Water</li>
<li>2 Tablespoons Olive Oil</li>
</ul>
</div>
</div>

<div id="outline-container-org86053f1" class="outline-3">
<h3 id="org86053f1">Instructions</h3>
<div class="outline-text-3" id="text-org86053f1">
<ol class="org-ol">
<li>Mix together flour, sugar, dry yeast and kosher salt. Slowly add water and olive oil. Mix together until dough forms into a ball. If the dough is too sticky, add a tablespoon of flour until it forms a ball. If the dough is too dry, add a tablespoon of warm water until it forms a ball. Once your dough is formed, knead into a smooth firm ball on a floured surface.</li>
<li>Grease a large bowl with olive oil and place your dough in the bowl. Cover with plastic wrap, and let sit for at least an hour.</li>
<li>The dough will double in size. Now flour your surface and cut the dough in half. Place a damp cloth over the dough and allow it to sit for 10 minutes. Now it's time to roll your dough out into whatever shape you like, while gently pulling the dough to stretch it.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org98a4ef4" class="outline-2">
<h2 id="org98a4ef4"><span class="timestamp-wrapper"><span class="timestamp">[2018-08-24 Fri] </span></span> My overnight oats&#xa0;&#xa0;&#xa0;<span class="tag"><span class="breakfast">breakfast</span></span></h2>
<div class="outline-text-2" id="text-org98a4ef4">
</div>
<div id="outline-container-org5c9d1e7" class="outline-3">
<h3 id="org5c9d1e7">Ingredients</h3>
<div class="outline-text-3" id="text-org5c9d1e7">
<ul class="org-ul">
<li>1 banana</li>
<li>1/2 cup of rolled oats</li>
<li>3/4 cup of oat milk</li>
<li>Shredded coconut</li>
<li>1 teaspoon of chia seeds</li>
<li>1-2 chopped dates</li>
</ul>
</div>
</div>

<div id="outline-container-org2820472" class="outline-3">
<h3 id="org2820472">Instructions</h3>
<div class="outline-text-3" id="text-org2820472">
<ol class="org-ol">
<li>Mush banana at the base of a glass jar</li>
<li>Add all other ingredients and mix</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgaa4fc56" class="outline-2">
<h2 id="orgaa4fc56"><span class="timestamp-wrapper"><span class="timestamp">[2018-08-18 Sat] </span></span> Chickpea Carrot Patties&#xa0;&#xa0;&#xa0;<span class="tag"><span class="patties">patties</span></span></h2>
<div class="outline-text-2" id="text-orgaa4fc56">
</div>
<div id="outline-container-orgd396bb2" class="outline-3">
<h3 id="orgd396bb2">Ingredients</h3>
<div class="outline-text-3" id="text-orgd396bb2">
<ul class="org-ul">
<li>1 carrot</li>
<li>1 clove garlic</li>
<li>1 can chickpeas</li>
<li>1.5 tsp ground cumin</li>
<li>1.5 tsp parsley</li>
<li>Salt + pepper</li>
<li>1 large egg (or aquafaba)</li>
<li>2 tbsp plain flour</li>
</ul>
</div>
</div>

<div id="outline-container-org8b3a35b" class="outline-3">
<h3 id="org8b3a35b">Instructions</h3>
<div class="outline-text-3" id="text-org8b3a35b">
<ol class="org-ol">
<li>Grate carrot coarsely and put aside</li>
<li>Combine chickpeas, garlic, spices on food processor. Slightly process into rough paste</li>
<li>Add carrot, egg, flour. Process until blended, but rugged</li>
<li>Fry 2-3 minutes each side</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org7813c10" class="outline-2">
<h2 id="org7813c10"><span class="timestamp-wrapper"><span class="timestamp">[2018-08-03 Fri] </span></span> Coconut Curry Lentil Soup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="soup">soup</span></span></h2>
<div class="outline-text-2" id="text-org7813c10">
<p>
<a href="http://vegangela.com/2014/01/09/coconut-curry-lentil-soup/">Original link</a>
</p>
</div>

<div id="outline-container-org7f94fb5" class="outline-3">
<h3 id="org7f94fb5">Ingredients</h3>
<div class="outline-text-3" id="text-org7f94fb5">
<ul class="org-ul">
<li>1 tbsp coconut oil (or olive oil)</li>
<li>1 large onion, chopped</li>
<li>2 cloves garlic, minced</li>
<li>1 tbsp fresh ginger, minced</li>
<li>2 tbsp tomato paste (or ketchup)</li>
<li>2 tbsp curry powder</li>
<li>½ tsp hot red pepper flakes</li>
<li>4 cups vegetable broth</li>
<li>1 400ml can coconut milk</li>
<li>1 400g can diced tomatoes</li>
<li>1.5 cups dry red lentils</li>
<li>2-3 handfuls of chopped kale or spinach</li>
<li>salt and pepper, to taste</li>
<li>Garnish: chopped cilantro (fresh coriander) and/or vegan sour cream</li>
</ul>
</div>
</div>
