org/recipes/recipes.org
** Instructions
   1. In a stockpot, heat the coconut oil over medium heat and stir-fry the onion, garlic and ginger until the onion is translucent, a couple minutes.
   2. Add the tomato paste (or ketchup), curry powder, and red pepper flakes and cook for another minute.
   3. Add the vegetable broth, coconut milk, diced tomatoes and lentils. Cover and bring to a boil, then simmer on low heat for 20-30 minutes, until the lentils are very tender. Season with salt and pepper.
   4. {Make-Ahead: May be cooled, frozen in air-tight containers, and re-heated over medium-low heat.}
   5. Before serving, stir in the kale/spinach and garnish with cilantro and/or vegan sour cream.

* [2018-07-31] Quinoa Enchilada Casserole                    :mexican:quinoa:
  [[https://minimalistbaker.com/mediterranean-baked-sweet-potatoes/][Original link]]

** Ingredients
   - 1 cup quinoa
   - Enchilada sauce
   - Capsicum
   - Avocado
   - Green chilies
   - Corn
   - Black beans
   - Cilantro
   - Cumin
   - Chili powder
   - 0.5 cup nutritional yeast
   - 0.5 - 1 cup bread crumbs

** Instructions
   1. In a large saucepan of 2 cups water, cook quinoa according to package instructions; set aside.
   2. Preheat oven to 375 degrees F. Lightly oil an 8×8 or 2 quart baking dish or coat with nonstick spray.
   3. In a large bowl, combine quinoa, enchilada sauce, green chiles, corn, black beans, cilantro, cumin and chili powder; season with salt and pepper, to taste. Stir in nutritional yeast.
   4. Spread quinoa mixture into the prepared baking dish. Top with bread crumbs. Place into oven and bake, about 15 minutes.
   5. Serve immediately, garnished with avocado and tomato, if desired.

* [2018-07-15] Vege Chilli Con Carne                                :mexican:
  [[http://www.jamieoliver.com/recipes/vegetables-recipes/veggie-chilli/][Original link]]

** Ingredients
   - 2 medium sweet potatoes (500g)
   - 1 level teaspoon cayenne pepper, plus extra for sprinkling
   - 1 heaped teaspoon ground cumin, plus extra for sprinkling
   - 1 level teaspoon ground cinnamon, plus extra for sprinkling
   - olive oil
   - 1 onion
   - 1 red pepper
   - 1 yellow pepper
   - 2 cloves of garlic
   - 1 bunch of fresh coriander
   - 1 fresh red chilli
   - 1 fresh green chilli
   - 2 400 g tinned beans, such as kidney, chickpea, pinto, cannellini
   - 2 400 g tins of quality plum tomatoes

** Instructions
   1. Preheat the oven to 200°C.
   2. Peel and chop the sweet potatoes into bite-sized chunks, then place onto a baking tray.
   3. Sprinkle with a pinch each of cayenne, cumin, cinnamon, sea salt and black pepper, drizzle with oil then toss to coat. Roast for 40 minutes, or until golden and tender.
   4. Peel and roughly chop the onion. Halve, deseed and roughly chop the peppers, then peel and finely chop the garlic.
   5. Pick the coriander leaves, finely chopping the stalks. Deseed and finely chop the chillies.
   6. Meanwhile, heat 2 tablespoons of oil in a large pan over a medium-high heat, add the onion, peppers and garlic, and cook for 5 minutes.
   7. Add the coriander stalks, chilli and spices, and cook for a further 5 to 10 minutes, or until softened, stirring occasionally.
   8. Drain and add the beans. Tip in the tomatoes, breaking them up with the back of a spoon, then stir well.
   9. Bring to the boil, then reduce to medium-low and leave to tick away for 25 to 30 minutes, or until thickened and reduced -- keep an eye on it, and add a splashes of water to loosen, if needed.
   10. Stir the roasted sweet potato through the chilli with most of the coriander leaves, then taste and adjust the seasoning, if needed.
   11. Scatter over the remaining coriander. Delicious served with soured cream, guacamole and rice or tortilla chips.

* [2018-06-12] Roast Carrot Lentil Curry Bowls              :rice:sauce:bowl:
  [[http://pinchofyum.com/lentil-curry-bowls-with-cilantro-cashew-sauce ][Original link]]

** Ingredients
*** For the Cilantro Cashew Sauce:
    - 1/2 cup fresh cilantro
    - 3/4 cup cashews (mine were salted)
    - ? cup water
    - 1/4 teaspoon salt
    - juice of 2 limes
    - 1 clove garlic (optional)
    - 1-2 teaspoons honey

*** For the Roasted Carrots:
    - 8-10 carrots, peeled and chopped into chunks
    - 1 tablespoon olive oil
    - 1 teaspoon garam masala
    - 1/2 teaspoon chili powder
    - salt to taste

*** For the Rice and Lentil Curry:
    - 1 cup basmati rice
    - 1 tablespoon oil
    - 1/2 cup chopped onion
    - 2 cloves garlic
    - 2 tablespoons red Thai curry paste
    - 1 teaspoon garam masala
    - 1/2 teaspoon cumin seed (or ground cumin)
    - 1 cup brown lentils, rinsed
    - 400 g tomato puree (passata)
    - 2 cups chicken or vegetable broth
    - pinch of salt
    - avocado and cilantro for topping

** Instructions
   1. For the sauce, puree all ingredients in a food processor or blender until smooth. Taste and adjust.
   2. For the carrots, toss all ingredients together. Roast at 450 degrees for 20-30 minutes or until golden brown and roasty. <-- favorite word.
   3. Cook the rice according to package directions. I used a rice cooker.
   4. For the curry, heat the oil in a skillet over medium heat. Add the onion and garlic; saute for 3-5 minutes. Add the curry paste and spices; saute for 2-3 minutes.
   5. Add the lentils, tomato sauce, and broth. Simmer until lots of the liquid has evaporated - continue adding ½ cup of liquid as needed (the lentils will just keep soaking it up). Repeat this process for about 30-45 minutes until the lentils are soft.
   6. Add the rice to the lentil mixture; stir to combine, adding extra broth or water as necessary. Season with salt.
   7. Serve in bowls topped with the roasted carrots, avocado slices, cilantro, and cilantro cashew dressing.

* [2018-05-14] Aussie Damper                                 :bread:noexport:
  [[https://foodequalshappyme.com/2013/01/13/aussie-damper/][Original link]]

** Ingredients:
   - 3 cups self raising flour
   - Pinch of salt
   - 80g chilled butter
   - 3/4 cup of water

** Instructions
   1. Sift flour and salt in a bowl. Cut the chilled butter into cubes and rub into the flour with your fingertips until the mixture looks like breadcrumbs.
   2. Make a well in the center and add the water. Using a butter knife in a cutting motion mix until the mixture comes together. If it looks a little dry you can add a little extra water.
   3. Turn the mixture out onto a floured surface, and pull it together with your hands. Knead it gently for 1-2mins or until it becomes smooth. Shape it into a round and using a knife dipped in flour, lightly mark 8 wedges on the top.
   4. Place it on a baking tray lined with baking paper. Sprinkle the top with flour, and bake for 35mins at 200 degrees celcius, or until golden and when tapped underneath sounds hollow.
   5. Leave it to cool on a wire rack for 30mins. If you cut it too soon it will look undercooked, however it just needs time to rest before cutting.

* [2018-05-14] Classic Italian Bread                         :bread:noexport:
  [[http://www.girlversusdough.com/2014/09/18/classic-italian-bread/][Original link]]

