docs/recipes/recipes.html

<div id="outline-container-org8a51f2a" class="outline-3">
<h3 id="org8a51f2a">Instructions</h3>
<div class="outline-text-3" id="text-org8a51f2a">
<ol class="org-ol">
<li>In a stockpot, heat the coconut oil over medium heat and stir-fry the onion, garlic and ginger until the onion is translucent, a couple minutes.</li>
<li>Add the tomato paste (or ketchup), curry powder, and red pepper flakes and cook for another minute.</li>
<li>Add the vegetable broth, coconut milk, diced tomatoes and lentils. Cover and bring to a boil, then simmer on low heat for 20-30 minutes, until the lentils are very tender. Season with salt and pepper.</li>
<li>{Make-Ahead: May be cooled, frozen in air-tight containers, and re-heated over medium-low heat.}</li>
<li>Before serving, stir in the kale/spinach and garnish with cilantro and/or vegan sour cream.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org0cc28bb" class="outline-2">
<h2 id="org0cc28bb"><span class="timestamp-wrapper"><span class="timestamp">[2018-07-31 Tue] </span></span> Quinoa Enchilada Casserole&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mexican">mexican</span>&#xa0;<span class="quinoa">quinoa</span></span></h2>
<div class="outline-text-2" id="text-org0cc28bb">
<p>
<a href="https://minimalistbaker.com/mediterranean-baked-sweet-potatoes/">Original link</a>
</p>
</div>

<div id="outline-container-orgd69bbc5" class="outline-3">
<h3 id="orgd69bbc5">Ingredients</h3>
<div class="outline-text-3" id="text-orgd69bbc5">
<ul class="org-ul">
<li>1 cup quinoa</li>
<li>Enchilada sauce</li>
<li>Capsicum</li>
<li>Avocado</li>
<li>Green chilies</li>
<li>Corn</li>
<li>Black beans</li>
<li>Cilantro</li>
<li>Cumin</li>
<li>Chili powder</li>
<li>0.5 cup nutritional yeast</li>
<li>0.5 - 1 cup bread crumbs</li>
</ul>
</div>
</div>

<div id="outline-container-org210774c" class="outline-3">
<h3 id="org210774c">Instructions</h3>
<div class="outline-text-3" id="text-org210774c">
<ol class="org-ol">
<li>In a large saucepan of 2 cups water, cook quinoa according to package instructions; set aside.</li>
<li>Preheat oven to 375 degrees F. Lightly oil an 8×8 or 2 quart baking dish or coat with nonstick spray.</li>
<li>In a large bowl, combine quinoa, enchilada sauce, green chiles, corn, black beans, cilantro, cumin and chili powder; season with salt and pepper, to taste. Stir in nutritional yeast.</li>
<li>Spread quinoa mixture into the prepared baking dish. Top with bread crumbs. Place into oven and bake, about 15 minutes.</li>
<li>Serve immediately, garnished with avocado and tomato, if desired.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgd7f4592" class="outline-2">
<h2 id="orgd7f4592"><span class="timestamp-wrapper"><span class="timestamp">[2018-07-15 Sun] </span></span> Vege Chilli Con Carne&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mexican">mexican</span></span></h2>
<div class="outline-text-2" id="text-orgd7f4592">
<p>
<a href="http://www.jamieoliver.com/recipes/vegetables-recipes/veggie-chilli/">Original link</a>
</p>
</div>

<div id="outline-container-orge000e20" class="outline-3">
<h3 id="orge000e20">Ingredients</h3>
<div class="outline-text-3" id="text-orge000e20">
<ul class="org-ul">
<li>2 medium sweet potatoes (500g)</li>
<li>1 level teaspoon cayenne pepper, plus extra for sprinkling</li>
<li>1 heaped teaspoon ground cumin, plus extra for sprinkling</li>
<li>1 level teaspoon ground cinnamon, plus extra for sprinkling</li>
<li>olive oil</li>
<li>1 onion</li>
<li>1 red pepper</li>
<li>1 yellow pepper</li>
<li>2 cloves of garlic</li>
<li>1 bunch of fresh coriander</li>
<li>1 fresh red chilli</li>
<li>1 fresh green chilli</li>
<li>2 400 g tinned beans, such as kidney, chickpea, pinto, cannellini</li>
<li>2 400 g tins of quality plum tomatoes</li>
</ul>
</div>
</div>

<div id="outline-container-orge584215" class="outline-3">
<h3 id="orge584215">Instructions</h3>
<div class="outline-text-3" id="text-orge584215">
<ol class="org-ol">
<li>Preheat the oven to 200\deg{}C.</li>
<li>Peel and chop the sweet potatoes into bite-sized chunks, then place onto a baking tray.</li>
<li>Sprinkle with a pinch each of cayenne, cumin, cinnamon, sea salt and black pepper, drizzle with oil then toss to coat. Roast for 40 minutes, or until golden and tender.</li>
<li>Peel and roughly chop the onion. Halve, deseed and roughly chop the peppers, then peel and finely chop the garlic.</li>
<li>Pick the coriander leaves, finely chopping the stalks. Deseed and finely chop the chillies.</li>
<li>Meanwhile, heat 2 tablespoons of oil in a large pan over a medium-high heat, add the onion, peppers and garlic, and cook for 5 minutes.</li>
<li>Add the coriander stalks, chilli and spices, and cook for a further 5 to 10 minutes, or until softened, stirring occasionally.</li>
<li>Drain and add the beans. Tip in the tomatoes, breaking them up with the back of a spoon, then stir well.</li>
<li>Bring to the boil, then reduce to medium-low and leave to tick away for 25 to 30 minutes, or until thickened and reduced &#x2013; keep an eye on it, and add a splashes of water to loosen, if needed.</li>
<li>Stir the roasted sweet potato through the chilli with most of the coriander leaves, then taste and adjust the seasoning, if needed.</li>
<li>Scatter over the remaining coriander. Delicious served with soured cream, guacamole and rice or tortilla chips.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org10d8382" class="outline-2">
<h2 id="org10d8382"><span class="timestamp-wrapper"><span class="timestamp">[2018-06-12 Tue] </span></span> Roast Carrot Lentil Curry Bowls&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rice">rice</span>&#xa0;<span class="sauce">sauce</span>&#xa0;<span class="bowl">bowl</span></span></h2>
<div class="outline-text-2" id="text-org10d8382">
<p>
<a href="http://pinchofyum.com/lentil-curry-bowls-with-cilantro-cashew-sauce%20">Original link</a>
</p>
</div>

<div id="outline-container-org0864447" class="outline-3">
<h3 id="org0864447">Ingredients</h3>
<div class="outline-text-3" id="text-org0864447">
</div>
<div id="outline-container-org81b4d03" class="outline-4">
<h4 id="org81b4d03">For the Cilantro Cashew Sauce:</h4>
<div class="outline-text-4" id="text-org81b4d03">
<ul class="org-ul">
<li>1/2 cup fresh cilantro</li>
<li>3/4 cup cashews (mine were salted)</li>
<li>? cup water</li>
<li>1/4 teaspoon salt</li>
<li>juice of 2 limes</li>
<li>1 clove garlic (optional)</li>
<li>1-2 teaspoons honey</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd84675" class="outline-4">
<h4 id="orgdd84675">For the Roasted Carrots:</h4>
<div class="outline-text-4" id="text-orgdd84675">
<ul class="org-ul">
<li>8-10 carrots, peeled and chopped into chunks</li>
<li>1 tablespoon olive oil</li>
<li>1 teaspoon garam masala</li>
<li>1/2 teaspoon chili powder</li>
<li>salt to taste</li>
</ul>
</div>
</div>

<div id="outline-container-org41194bc" class="outline-4">
<h4 id="org41194bc">For the Rice and Lentil Curry:</h4>
<div class="outline-text-4" id="text-org41194bc">
<ul class="org-ul">
<li>1 cup basmati rice</li>
<li>1 tablespoon oil</li>
<li>1/2 cup chopped onion</li>
<li>2 cloves garlic</li>
<li>2 tablespoons red Thai curry paste</li>
<li>1 teaspoon garam masala</li>
<li>1/2 teaspoon cumin seed (or ground cumin)</li>
<li>1 cup brown lentils, rinsed</li>
<li>400 g tomato puree (passata)</li>
<li>2 cups chicken or vegetable broth</li>
<li>pinch of salt</li>
<li>avocado and cilantro for topping</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org794f60f" class="outline-3">
<h3 id="org794f60f">Instructions</h3>
<div class="outline-text-3" id="text-org794f60f">
<ol class="org-ol">
<li>For the sauce, puree all ingredients in a food processor or blender until smooth. Taste and adjust.</li>
<li>For the carrots, toss all ingredients together. Roast at 450 degrees for 20-30 minutes or until golden brown and roasty. &lt;&#x2013; favorite word.</li>
<li>Cook the rice according to package directions. I used a rice cooker.</li>
<li>For the curry, heat the oil in a skillet over medium heat. Add the onion and garlic; saute for 3-5 minutes. Add the curry paste and spices; saute for 2-3 minutes.</li>
<li>Add the lentils, tomato sauce, and broth. Simmer until lots of the liquid has evaporated - continue adding ½ cup of liquid as needed (the lentils will just keep soaking it up). Repeat this process for about 30-45 minutes until the lentils are soft.</li>
<li>Add the rice to the lentil mixture; stir to combine, adding extra broth or water as necessary. Season with salt.</li>
<li>Serve in bowls topped with the roasted carrots, avocado slices, cilantro, and cilantro cashew dressing.</li>
</ol>
</div>
</div>
</div>
