org/recipes/recipes.org
** Ingredients
   - 2 1/4 teaspoons (1 packet) Red Star active dry yeast
   - 1 teaspoon granulated sugar
   - 1 cup warm water (about 110 degrees F)
   - 2 1/2 cups bread or all-purpose flour
   - 2 tablespoons olive oil
   - 1 teaspoon salt

** Instructions
   1. In a large bowl or bowl of a stand mixer, combine yeast, sugar and warm water. Let stand 5 minutes until yeast is foamy.
   2. Add 2 cups flour, olive oil and salt. Stir with a wooden spoon or with a dough hook on low speed until a shaggy dough forms. Turn dough out onto a lightly floured surface and knead by hand 10 minutes, adding just enough of the remaining flour until a soft, smooth and elastic dough forms; OR, increase dough hook speed to medium and knead dough in stand mixer 5 minutes, adding just enough of the remaining flour until a soft, smooth and elastic dough forms.
   3. Shape dough into a ball; place in an oiled bowl and turn to coat. Cover bowl with plastic wrap and let dough rise 1 hour until doubled.
   4. Heat oven to 400 degrees F. Line a baking sheet with a silicone mat or lightly grease the surface with oil or cooking spray. On a lightly floured surface, punch down dough, then carefully shape into a batard/torpedo about 12 inches long. Transfer to prepared baking sheet. Cover with a tea towel and let rise another 20 minutes until puffy.
   5. Use a serrated knife to make a few ¼-inch deep slits in the surface of the loaf. Bake loaf 20 minutes until golden brown. Cool completely on a cooling rack before slicing.

* [2018-05-14] Creamy Jalapeno Avocado Sauce                          :sauce:
  [[https://livingfoodlove.wordpress.com/2014/05/29/raw-vegan-creamy-jalapeno-avocado-sauce/][Original link]]

** Ingredients
   - 2 avocados
   - 2 fresh jalenpenos, seeded
   - Juice of 1 lemon
   - 5.8 cup water
   - 1/6 cup cashew butter
   - 1.5 tbsp shallots
   - 2 tbsp cilantro

** Instructions
   1. Blend

* [2018-05-14] Mediterranean Baked Sweet Potatoes    :mediterranean:noexport:
  [[https://minimalistbaker.com/mediterranean-baked-sweet-potatoes/][Original link]]

** Ingredients
   - 4 medium sweet potatoes* (~140 g each)
   - 1 can (400 g) chickpeas, rinsed and drained
   - 1/2 Tbsp olive oil
   - 1/2 tsp each cumin, coriander, cinnamon, smoked (or regular) paprika
   - optional: Pinch of sea salt or lemon juice

*** Garlic herb sauce
    - 1/4 cup (60 g) hummus (or tahini)
    - juice of 1/2 lemon (~1 Tbsp)
    - 3/4 - 1 tsp dried dill (or sub 2-3 tsp fresh)
    - 3 cloves garlic, minced (1 1/2 Tbsp or 9 g)
    - Water or unsweetened almond milk to thin
    - optional: Sea salt to taste (I didn't need any)

*** Toppings
    - 1/4 cup (45 g) cherry tomatoes, diced
    - 1/4 cup (15 g) chopped parsley, minced
    - 2 Tbsp (30 ml) lemon juice
    - Chili garlic sauce

** Instructions
   1. Preheat oven to 400 degrees and line a large baking sheet with foil.
   2. Rinse and scrub potatoes and cut in half length wise. This will speed cooking time. Otherwise leave whole and bake longer (approximately double the time (45 min - 1 hour).
   3. Toss rinsed and drained chickpeas with olive oil and spices and place on a foil-lined baking sheet.
   4. Rub the sweet potatoes with a bit of olive oil and place face down on the same baking sheet (or another baking sheet depending on size).
   5. While the sweet potatoes and chickpeas are roasting, prepare your sauce by adding all ingredients to a mixing bowl and whisking to combine, only adding enough water to almond milk to thin so it's pourable. Taste and adjust seasonings as needed. Add more garlic for more zing, salt for savoriness, lemon juice for freshness, and dill for a more intense herb flavor. I found mine didn't need anything else.
   6. NOTE: If you don't have hummus, tahini will make a great base substitute for the sauce - just adjust the seasonings to accommodate the lack of flavor tahini provides.
   7. Also prepare the parsley-tomato topping by tossing tomato and parsley with lemon juice and setting aside to marinate.
   8. Once sweet potatoes are fork tender and the chickpeas are golden brown - roughly 25 minutes - remove from oven.
   9. For serving, flip potatoes flesh-side up and smash down the insides a little bit. Then top with chickpeas, sauce and parsley-tomato garnish. Serve immediately.
   10. Additional side ideas might include Hummus, Pita Chips, Baba Ganoush, or Persian Eggplant Dip. Enjoy!

* [2018-05-14] Simmered Coconut Curried Tofu                      :tofu:rice:

** Ingredients
   - 1 block firm tofu
   - 1 tablespoon olive oil
   - 2 teaspoons sesame oil
   - 3 tablespoons peanut butter
   - 2 tablespoons soy sauce
   - 2 tablespoons water
   - 1 teaspoon curry powder
   - 1/4 cup coconut flakes
   - 2 tablespoons minced fresh cilantro

** Instructions
   1. Sure tofu in oil till brown
   2. Reduce heat to medium and add sesame oil, peanut butter, soy sauce, water and curry powder. Stir in and heat for 5 minutes
   3. Add coconut flakes and cilantro. Heat for 1 min

* [2018-05-14] Spicy Buddha Bowl                                       :bowl:
  [[http://www.crazyvegankitchen.com/spicy-buddha-bowl/][Original link]]

** Ingredients
   - 1 cup Cooked Brown Rice
   - 1 Sweet Potato, cut into large chunks
   - 1 teaspoon Olive Oil
   - Salt/Pepper
   - 1 can Organic Chickpeas, drained
   - 1 1/2 tablespoons Sriracha
   - 2 teaspoons Maple Syrup
   - 1/2 teaspoon Paprika
   - 1/2 teaspoon Garlic Powder
   - Salt/Pepper
   - 1 cup chopped Red Cabbage
   - 1 cup Baby Spinach
   - 1 Avocado, sliced
   - Turmeric Tahini Dressing:
   - 4 Tablespoons Tahini
   - 4 Tablespoons Warm Water
   - 1 teaspoon Maple Syrup
   - 1/4 teaspoon Cayenne Pepper
   - 1/2 teaspoon Turmeric
   - 1/2 teaspoon Sriracha
   - Salt to taste

** Instructions
   1. Preheat oven to 180 degrees Celsius. Coat sweet potato in 1 tsp oil and season with salt and pepper. Place on baking tray and pop into the oven to roast for 35 minutes, turning once halfway through the cooking time.
   2. Whilst sweet potato is cooking, prepare chickpeas.
   3. In a bowl, combine chickpeas, sriracha, maple syrup, paprika, garlic powder, salt and pepper. Mix to combine. Heat a saucepan and transfer chickpea mixture into saucepan to cook for 5-10 minutes. Make sure to keep the chickpeas moving so they don't burn. Cook until chickpeas are slightly sticky and no longer watery. Keep aside.
   4. In a clean saucepan, wilt spinach slightly and season. Transfer to a bowl and repeat the wilting and seasoning process with the cabbage.
   5. Once sweet potato is cooked through, prepare your Buddha Bowl by placing your rice in the bottom of a bowl and then topping with the sweet potato, chickpeas, spinach, red cabbage and avocado.
   6. To make dressing, whisk all ingredients together. Liberally splash on Buddha Bowl and enjoy!!!

* [2018-05-14] Sweet Potato Chickpea Buddha Bowl        :rice:bowl:chickpeas:
  [[https://minimalistbaker.com/sweet-potato-chickpea-buddha-bowl/][Original link]]

** Ingredients
   - 2 Tbsp olive, melted coconut, or grape seed oil
   - 1/2 red onion, sliced in wedges
   - 2 large sweet potatoes, halved
   - 1 bundle (227 g) broccolini, large stems removed, chopped
   - 2 big handfuls kale, larger stems removed
   - 1/4 tsp each salt + pepper

*** Chickpeas
    - 1 can (400 g) chickpeas, drained, rinsed + patted dry
    - 1 tsp cumin
    - 3/4 tsp chili powder
    - 3/4 tsp garlic powder
    - 1/4 tsp each salt + pepper
    - 1/2 tsp oregano (optional)
    - 2/4 tsp turmeric (optional)

*** Tahini sauce (optional)
    - 1/4 cup (56 g) tahini
    - 1 Tbsp maple syrup
    - 1/2 lemon, juiced
    - 2-4 Tbsp hot water to thin

