docs/recipes/recipes.html

<div id="outline-container-org355ab16" class="outline-2">
<h2 id="org355ab16"><span class="timestamp-wrapper"><span class="timestamp">[2018-05-14 Mon] </span></span> Creamy Jalapeno Avocado Sauce&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sauce">sauce</span></span></h2>
<div class="outline-text-2" id="text-org355ab16">
<p>
<a href="https://livingfoodlove.wordpress.com/2014/05/29/raw-vegan-creamy-jalapeno-avocado-sauce/">Original link</a>
</p>
</div>

<div id="outline-container-org568257c" class="outline-3">
<h3 id="org568257c">Ingredients</h3>
<div class="outline-text-3" id="text-org568257c">
<ul class="org-ul">
<li>2 avocados</li>
<li>2 fresh jalenpenos, seeded</li>
<li>Juice of 1 lemon</li>
<li>5.8 cup water</li>
<li>1/6 cup cashew butter</li>
<li>1.5 tbsp shallots</li>
<li>2 tbsp cilantro</li>
</ul>
</div>
</div>

<div id="outline-container-orgbde11e6" class="outline-3">
<h3 id="orgbde11e6">Instructions</h3>
<div class="outline-text-3" id="text-orgbde11e6">
<ol class="org-ol">
<li>Blend</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org0e44fee" class="outline-2">
<h2 id="org0e44fee"><span class="timestamp-wrapper"><span class="timestamp">[2018-05-14 Mon] </span></span> Simmered Coconut Curried Tofu&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tofu">tofu</span>&#xa0;<span class="rice">rice</span></span></h2>
<div class="outline-text-2" id="text-org0e44fee">
</div>
<div id="outline-container-org635dac4" class="outline-3">
<h3 id="org635dac4">Ingredients</h3>
<div class="outline-text-3" id="text-org635dac4">
<ul class="org-ul">
<li>1 block firm tofu</li>
<li>1 tablespoon olive oil</li>
<li>2 teaspoons sesame oil</li>
<li>3 tablespoons peanut butter</li>
<li>2 tablespoons soy sauce</li>
<li>2 tablespoons water</li>
<li>1 teaspoon curry powder</li>
<li>1/4 cup coconut flakes</li>
<li>2 tablespoons minced fresh cilantro</li>
</ul>
</div>
</div>

<div id="outline-container-orgea6d067" class="outline-3">
<h3 id="orgea6d067">Instructions</h3>
<div class="outline-text-3" id="text-orgea6d067">
<ol class="org-ol">
<li>Sure tofu in oil till brown</li>
<li>Reduce heat to medium and add sesame oil, peanut butter, soy sauce, water and curry powder. Stir in and heat for 5 minutes</li>
<li>Add coconut flakes and cilantro. Heat for 1 min</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgd1b3c9c" class="outline-2">
<h2 id="orgd1b3c9c"><span class="timestamp-wrapper"><span class="timestamp">[2018-05-14 Mon] </span></span> Spicy Buddha Bowl&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bowl">bowl</span></span></h2>
<div class="outline-text-2" id="text-orgd1b3c9c">
<p>
<a href="http://www.crazyvegankitchen.com/spicy-buddha-bowl/">Original link</a>
</p>
</div>

<div id="outline-container-org131ca7b" class="outline-3">
<h3 id="org131ca7b">Ingredients</h3>
<div class="outline-text-3" id="text-org131ca7b">
<ul class="org-ul">
<li>1 cup Cooked Brown Rice</li>
<li>1 Sweet Potato, cut into large chunks</li>
<li>1 teaspoon Olive Oil</li>
<li>Salt/Pepper</li>
<li>1 can Organic Chickpeas, drained</li>
<li>1 1/2 tablespoons Sriracha</li>
<li>2 teaspoons Maple Syrup</li>
<li>1/2 teaspoon Paprika</li>
<li>1/2 teaspoon Garlic Powder</li>
<li>Salt/Pepper</li>
<li>1 cup chopped Red Cabbage</li>
<li>1 cup Baby Spinach</li>
<li>1 Avocado, sliced</li>
<li>Turmeric Tahini Dressing:</li>
<li>4 Tablespoons Tahini</li>
<li>4 Tablespoons Warm Water</li>
<li>1 teaspoon Maple Syrup</li>
<li>1/4 teaspoon Cayenne Pepper</li>
<li>1/2 teaspoon Turmeric</li>
<li>1/2 teaspoon Sriracha</li>
<li>Salt to taste</li>
</ul>
</div>
</div>

<div id="outline-container-org25d74dc" class="outline-3">
<h3 id="org25d74dc">Instructions</h3>
<div class="outline-text-3" id="text-org25d74dc">
<ol class="org-ol">
<li>Preheat oven to 180 degrees Celsius. Coat sweet potato in 1 tsp oil and season with salt and pepper. Place on baking tray and pop into the oven to roast for 35 minutes, turning once halfway through the cooking time.</li>
<li>Whilst sweet potato is cooking, prepare chickpeas.</li>
<li>In a bowl, combine chickpeas, sriracha, maple syrup, paprika, garlic powder, salt and pepper. Mix to combine. Heat a saucepan and transfer chickpea mixture into saucepan to cook for 5-10 minutes. Make sure to keep the chickpeas moving so they don't burn. Cook until chickpeas are slightly sticky and no longer watery. Keep aside.</li>
<li>In a clean saucepan, wilt spinach slightly and season. Transfer to a bowl and repeat the wilting and seasoning process with the cabbage.</li>
<li>Once sweet potato is cooked through, prepare your Buddha Bowl by placing your rice in the bottom of a bowl and then topping with the sweet potato, chickpeas, spinach, red cabbage and avocado.</li>
<li>To make dressing, whisk all ingredients together. Liberally splash on Buddha Bowl and enjoy!!!</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org504822e" class="outline-2">
<h2 id="org504822e"><span class="timestamp-wrapper"><span class="timestamp">[2018-05-14 Mon] </span></span> Sweet Potato Chickpea Buddha Bowl&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rice">rice</span>&#xa0;<span class="bowl">bowl</span>&#xa0;<span class="chickpeas">chickpeas</span></span></h2>
<div class="outline-text-2" id="text-org504822e">
<p>
<a href="https://minimalistbaker.com/sweet-potato-chickpea-buddha-bowl/">Original link</a>
</p>
</div>

<div id="outline-container-orgd1b61a5" class="outline-3">
<h3 id="orgd1b61a5">Ingredients</h3>
<div class="outline-text-3" id="text-orgd1b61a5">
<ul class="org-ul">
<li>2 Tbsp olive, melted coconut, or grape seed oil</li>
<li>1/2 red onion, sliced in wedges</li>
<li>2 large sweet potatoes, halved</li>
<li>1 bundle (227 g) broccolini, large stems removed, chopped</li>
<li>2 big handfuls kale, larger stems removed</li>
<li>1/4 tsp each salt + pepper</li>
</ul>
</div>

<div id="outline-container-orge29c23d" class="outline-4">
<h4 id="orge29c23d">Chickpeas</h4>
<div class="outline-text-4" id="text-orge29c23d">
<ul class="org-ul">
<li>1 can (400 g) chickpeas, drained, rinsed + patted dry</li>
<li>1 tsp cumin</li>
<li>3/4 tsp chili powder</li>
<li>3/4 tsp garlic powder</li>
<li>1/4 tsp each salt + pepper</li>
<li>1/2 tsp oregano (optional)</li>
<li>2/4 tsp turmeric (optional)</li>
</ul>
</div>
</div>

<div id="outline-container-org0241b4d" class="outline-4">
<h4 id="org0241b4d">Tahini sauce (optional)</h4>
<div class="outline-text-4" id="text-org0241b4d">
<ul class="org-ul">
<li>1/4 cup (56 g) tahini</li>
<li>1 Tbsp maple syrup</li>
<li>1/2 lemon, juiced</li>
<li>2-4 Tbsp hot water to thin</li>
</ul>
</div>
</div>
</div>
