org/recipes/recipes.org
** Instructions
   1. Preheat oven to 400 degrees F and arrange sweet potatoes and onions on a bare baking sheet. Drizzle both with a bit of oil, making sure the flesh of the sweet potatoes are well coated and placed skin side down on the sheet.
   2. Bake for 10 minutes, then remove from oven flip sweet potatoes and add broccolini. Drizzle broccolini with a bit of oil and season with a pinch each salt and pepper.
   3. Bake for another 8-10 minutes, then remove from oven and add kale. Drizzle kale with a touch more oil and season with a pinch each salt and pepper. Bake for another 4-5 minutes then set aside.
   4. While vegetables are roasting, heat a large skillet over medium heat and add chickpeas to a mixing bowl and toss with seasonings.
   5. Once hot, add 1 Tbsp oil and chickpeas and sauté, stirring frequently. If they're browning too quickly, turn down heat. If there isn't much browning going on, increase heat. I found 10 minutes total at slightly over medium heat was perfect.
   6. Once the chickpeas are browned and fragrant, remove from heat and set aside.
   7. Prepare sauce by adding tahini, maple syrup and lemon juice to a mixing bowl and whisking to combine. Add hot water until a pourable sauce is formed. Set aside.
   8. To serve: Slice sweet potatoes into bite size pieces. Divide vegetables between 3 serving bowls and top with chickpeas + tahini sauce.
   8. Best when fresh, though leftovers will keep for a few days in the fridge.

* [2018-05-14] Tortilla Soup                          :mexican:soup:noexport:
  [[http://www.simplyrecipes.com/recipes/tortilla_soup/][Original link]]

** Ingredients
   - 6 (6-inch) corn tortillas, preferably a little old and dried out
   - 1/4 cup canola oil, peanut oil, or other high smoke-point oil
   - 1/2 cup chopped onion
   - 2 cloves garlic, minced
   - 1 medium Anaheim, poblano or jalapeño chile, seeded, veins removed, chopped (Depending on the hotness and flavor desired. You can also mix chiles - 1 Anaheim and a half jalapeño.)
   - 4 cups chicken broth or homemade chicken stock
   - 1 can (400 g) diced tomatoes, undrained (recommended Muir Glen fire-roasted)
   - 1/2 teaspoon coarse salt (kosher or sea salt)
   - 1 1/2 cups shredded cooked chicken
   - 1 ripe avocado
   - 1/2 cup (50 g) shredded Monterey Jack cheese (or mild cheddar)
   - Chopped fresh cilantro
   - 1 lime, cut into wedges

** Instructions
   1. Fry tortilla strips: If you are starting with somewhat old, dried out tortillas, great. If not and you are starting with relatively fresh tortillas, put them on a baking sheet and put them in the oven at 200°F for 10-15 minutes to dry them out a bit. It is best to start with tortillas that don't have a lot of moisture in them. Cut the tortillas in half, and then cut the halves into 1/4-inch wide strips. Heat oil over medium-high heat in a 3-quart pot. Working in three batches, fry the tortilla strips in the oil, until lightly browned and crisp. Remove the tortilla strips from the pan and let drain on a paper-towel-lined plate.
   2. Sauté onions, chile, garlic: Add the chopped onions to the pan, cook 2 minutes, stirring frequently. Add the chopped chile and cook for 2-3 minutes more, until the onions and chiles have softened. Add the garlic and cook for 30 seconds more.
   3. Add broth, tomatoes, salt, chicken: Add the broth, tomatoes, and salt. Increase the heat to high, heat until the soup begins to boil, then reduce the heat to a low simmer, cover and simmer for 15 minutes. Add the shredded chicken and cook until heated through.
   4. Serve with tortilla strips and garnishes: To serve, pit, peel, and cut the avocado into 1-inch pieces. Divide half of tortilla strips among 4 individual serving bowls; ladle in soup. Top with avocado and cheese; garnish with remaining tortilla strips and cilantro. Serve with lime wedges.

* [2018-05-14] West African Peanut Soup                  :soup:rice:noexport:
  [[http://cookieandkate.com/2013/west-african-peanut-soup/][Original link]]

** Ingredients
   - 6 cups low sodium vegetable broth
   - 1 medium red onion, chopped
   - 2 tablespoons peeled and minced fresh ginger
   - 4 cloves garlic, minced
   - 1 teaspoon salt
   - 1 bunch collard greens (or kale), ribs removed and leaves chopped into 1-inch strips
   - 0.75 cup unsalted peanut butter (chunky or smooth)
   - 0.5 cup tomato paste*
   - Hot sauce, like sriracha (AKA rooster sauce)
   - 0.25 cup roughly chopped peanuts, for garnish

** Instructions
   1. In a medium Dutch oven or stock pot, bring the broth to a boil. Add the onion, ginger, garlic and salt. Cook on medium-low heat for 20 minutes.
   2. In a medium-sized, heat-safe mixing bowl, combine the peanut butter and tomato paste, then transfer 1 to 2 cups of the hot stock to the bowl. Whisk the mixture together until smooth, then pour the peanut mixture back into the soup and mix well. Stir in the collard greens and season the soup with hot sauce to taste.
   3. Simmer for about 15 more minutes on medium-low heat, stirring often. Serve over cooked brown rice if you'd like, and top with a sprinkle of chopped peanuts.
* [2018-04-14] Vegetable Paella                       :mexican:rice:noexport:
  [[https://realfood.tesco.com/recipes/vegetable-paella.html][Original link]]

** Ingredients
   - 1 tbsp oil
   - 1 onion, chopped
   - 1 garlic clove, finely chopped
   - 300g paella rice or short grain rice
   - 2tsp smoked paprika
   - 900ml (1½pt) vegetable stock
   - 1 x 400g tin chopped tomatoes
   - 150g runner beans, sliced on an angle
   - 1 red pepper, roughly chopped
   - 1 x 210g tin chickpeas, drained
   - handful parsley, roughly chopped
   - 1 tsp dried chilli flakes
   - 1 lemon, juiced
   - a pinch of salt
   - 1 pinch of pepper

** Instructions
   1. Heat 1 tbsp oil in a large frying pan and cook the onion and garlic for 5 minutes, until softened.
   2. Stir in the rice, chilli flakes and paprika, cook for a further minute, then add the stock and tomatoes. Bring to the boil and simmer for 10 minutes, stirring occasionally.
   3. Add the runner beans, pepper and chickpeas and cook for another 10 minutes. Squeeze over the lemon juice and scatter with the parsley.
   4. Serve with lemon

* [2018-04-14] Vegetarian Burrito Bowl                                 :rice:
  [[http://thefoodiephysician.com/2015/03/dining-with-doc-protein-packed.html][Original link]]

** Ingredients
   - 4 Chile Relleno Boca Essentials patties
   - 3 cups cooked brown rice
   - 1 cup grape tomatoes, quartered
   - 1 ½ cups shredded Romaine lettuce
   - ½ ripe Haas avocado, diced (optional)

*** Corn salsa:
    - 1 cup cooked corn
    - 2 tablespoons finely chopped red onion
    - 1 tablespoon chopped cilantro
    - 1 teaspoon lime juice
    - Salt

*** Avocado Cilantro Sauce:
    - ½ ripe Haas avocado
    - 2 tablespoons nonfat plain Greek yogurt
    - 2 tablespoons cilantro
    - 1 ½ teaspoons lime juice
    - ½ teaspoon honey
    - 2 tablespoons water
    - Kosher salt

** Instructions
   1. Cook the Chile Relleno Boca Essentials patties according to package directions. Chop them into bite-sized pieces.
   2. Mix all of the corn salsa ingredients together in a bowl.
   3. To make the avocado cilantro sauce, puree all of the ingredients in a mini food processor or blender. Adjust seasoning to taste.
   4. Divide the rice among 4 bowls. Top with equal portions of Boca patties, corn salsa, tomato, lettuce and avocado. Drizzle the avocado cilantro sauce on top. Enjoy!

