docs/recipes/recipes.html

<div id="outline-container-orgd9ef83c" class="outline-3">
<h3 id="orgd9ef83c">Instructions</h3>
<div class="outline-text-3" id="text-orgd9ef83c">
<ol class="org-ol">
<li>Preheat oven to 400 degrees F and arrange sweet potatoes and onions on a bare baking sheet. Drizzle both with a bit of oil, making sure the flesh of the sweet potatoes are well coated and placed skin side down on the sheet.</li>
<li>Bake for 10 minutes, then remove from oven flip sweet potatoes and add broccolini. Drizzle broccolini with a bit of oil and season with a pinch each salt and pepper.</li>
<li>Bake for another 8-10 minutes, then remove from oven and add kale. Drizzle kale with a touch more oil and season with a pinch each salt and pepper. Bake for another 4-5 minutes then set aside.</li>
<li>While vegetables are roasting, heat a large skillet over medium heat and add chickpeas to a mixing bowl and toss with seasonings.</li>
<li>Once hot, add 1 Tbsp oil and chickpeas and sauté, stirring frequently. If they're browning too quickly, turn down heat. If there isn't much browning going on, increase heat. I found 10 minutes total at slightly over medium heat was perfect.</li>
<li>Once the chickpeas are browned and fragrant, remove from heat and set aside.</li>
<li>Prepare sauce by adding tahini, maple syrup and lemon juice to a mixing bowl and whisking to combine. Add hot water until a pourable sauce is formed. Set aside.</li>
<li>To serve: Slice sweet potatoes into bite size pieces. Divide vegetables between 3 serving bowls and top with chickpeas + tahini sauce.</li>
<li>Best when fresh, though leftovers will keep for a few days in the fridge.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgb74dbc6" class="outline-2">
<h2 id="orgb74dbc6"><span class="timestamp-wrapper"><span class="timestamp">[2018-04-14 Sat] </span></span> Vegetarian Burrito Bowl&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rice">rice</span></span></h2>
<div class="outline-text-2" id="text-orgb74dbc6">
<p>
<a href="http://thefoodiephysician.com/2015/03/dining-with-doc-protein-packed.html">Original link</a>
</p>
</div>

<div id="outline-container-org25b17f6" class="outline-3">
<h3 id="org25b17f6">Ingredients</h3>
<div class="outline-text-3" id="text-org25b17f6">
<ul class="org-ul">
<li>4 Chile Relleno Boca Essentials patties</li>
<li>3 cups cooked brown rice</li>
<li>1 cup grape tomatoes, quartered</li>
<li>1 ½ cups shredded Romaine lettuce</li>
<li>½ ripe Haas avocado, diced (optional)</li>
</ul>
</div>

<div id="outline-container-org4699927" class="outline-4">
<h4 id="org4699927">Corn salsa:</h4>
<div class="outline-text-4" id="text-org4699927">
<ul class="org-ul">
<li>1 cup cooked corn</li>
<li>2 tablespoons finely chopped red onion</li>
<li>1 tablespoon chopped cilantro</li>
<li>1 teaspoon lime juice</li>
<li>Salt</li>
</ul>
</div>
</div>

<div id="outline-container-orgeae9b45" class="outline-4">
<h4 id="orgeae9b45">Avocado Cilantro Sauce:</h4>
<div class="outline-text-4" id="text-orgeae9b45">
<ul class="org-ul">
<li>½ ripe Haas avocado</li>
<li>2 tablespoons nonfat plain Greek yogurt</li>
<li>2 tablespoons cilantro</li>
<li>1 ½ teaspoons lime juice</li>
<li>½ teaspoon honey</li>
<li>2 tablespoons water</li>
<li>Kosher salt</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbd6f9d1" class="outline-3">
<h3 id="orgbd6f9d1">Instructions</h3>
<div class="outline-text-3" id="text-orgbd6f9d1">
<ol class="org-ol">
<li>Cook the Chile Relleno Boca Essentials patties according to package directions. Chop them into bite-sized pieces.</li>
<li>Mix all of the corn salsa ingredients together in a bowl.</li>
<li>To make the avocado cilantro sauce, puree all of the ingredients in a mini food processor or blender. Adjust seasoning to taste.</li>
<li>Divide the rice among 4 bowls. Top with equal portions of Boca patties, corn salsa, tomato, lettuce and avocado. Drizzle the avocado cilantro sauce on top. Enjoy!</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
